[
{"title": "Data Scientist", "company": "NIEHS", "location": "NIEHS-Durham, NC 27709", "desc": "$75,628 - $98,317 a yearWe are looking to hire two Data Scientist positions at the National Institute of Environmental Health Sciences (NIEHS) in Research Triangle Park, NC.NOTE: applications for the positions will be accepted from Dec. 13 through Dec. 17 on USAjobs (https://www.usajobs.gov/).Come apply your biomedical knowledge and computing skills (especially Python, R, and JavaScript) to enable the discovery, access, and use of data needed to advance environmental health research, policy, and decision-making. Looking for candidates who like to keep learning and applying new approaches and technologies.The first position supports the Division of the National Toxicology Program (DNTP) efforts in the collection, management, reporting, analysis, visualization and storing of experimental toxicology data. The second position is within the Office of Data Science (ODS), which serves the data science needs of the entire institute through the development and application of data methods, computer technologies, and data systems.Primary responsibilities will include:1) development and support of web-applications and databases and user-friendly web-based interfaces;2) design, deployment, and maintenance of computer tools and methods to enhance the extraction, analysis, visualization and usage of data; and3) assistance in the development and deployment of data and knowledge systems (especially the NIEHS Data Commons and interoperability with the NIH Data Commons).Job Type: Full-timeSalary: $75,628.00 to $98,317.00 /yearExperience:Python: 2 years (Required)Javascript: 2 years (Required)working with scientific data: 1 year (Required)Data Analysis: 1 year (Required)R: 2 years (Preferred)", "link": "https://www.indeed.com/cmp/NIEHS/jobs/Data-Scientist-b4e60d9398cbbf13?vjs=3"},
{"title": "Data Science, Intern", "company": "Automated Insights", "location": "Automated Insights2 reviews-Durham, NC 27701", "desc": "InternshipAbout Automated Insights\n\nAutomated Insights (Ai) helps organizations make better business decisions, faster. By empowering data-driven organizations with Ai’s proprietary natural language generation (NLG) platform, Wordsmith, businesses are able to deliver the right insight, to the right person, at the right time and in the easiest-to-understand medium—the written word. Wordsmith makes exploring, discovering, and communicating insights easier than ever before. Our Wordsmith platform turns raw data into written narratives for clients like Activision, Yahoo!, and the Associated Press.\n\nAt Automated Insights, we are dedicated to treating all Ai-ers with respect, autonomy, and generosity. We strive to provide a best-in-career work experience for each and every employee. We know that having an excellent company culture is an advantage and we’ve created an environment which empowers our team to do their best work. We've even been recognized for this and are a five-time winner of Triangle Business Journal's Best Place to Work Award.\n\nWhy does the Data Science internship exist?\n\nThe Data Science team is looking for interns who are excited to hone their skills building innovative technology that makes our customers’ lives easier. Our interns are full members of the team; they participate in project meetings, present results to company stakeholders, and produce as much as they learn. At the end of your internship, you'll walk away with a great understanding of how a tight-knit, fast-paced team turns ideas into customer-facing products.\n\nWhat would I do as a Data Science intern?\n\nWork with data scientists, software engineers, and product managers to understand our customers' goals and problems, and help us use machine learning and natural language processing to solve those problems.\nTake ownership over transforming your ideas into reality – you'll prototype new algorithms, write high-quality, professional code, and be responsible for documenting your work and results.\nBe a member of the team by participating in team planning meetings, standups, reading groups, and code reviews.\n\nWhat is experience is required?\n\nStudents pursuing an undergrad or advanced degree in a technical discipline.\nProgramming experience in a language like Python or Javascript.\nExperience outside of the classroom, like previous industry work, open-source contributions, or personal side projects.\nQuick learners who love jumping into difficult projects.\nBonus points if you have a solid understanding of the fundamentals of machine learning and experience dealing with unstructured data.\n\nWhat’s cool about the job?\n\nYou’ll collaborate with other software engineers via pair programming, PR Reviews, stand-ups, and planning meetings.\nYou’ll understand and help refine technical requirements by working with data scientists and product managers.\nYou’ll make a big impact on mission-critical projects.", "link": "https://www.indeed.com/viewjob?jk=76b11e68bdacf6e6&from=serp&vjs=3"},
{"title": "Data Scientist", "company": "Hi Fidelity Genetics", "location": "Hi Fidelity Genetics-Durham, NC 27701", "desc": "Hi Fidelity Genetics is using large morphologic, genomic, and environmental datasets to change the breeding paradigm from a brute force numbers game to a predictive, precision data science.The data scientist will assist with a variety of activities, like conducting analyses to answer key strategic questions; modeling the relationship between plant traits, genetics, and the environment; and developing software.QualificationsGraduate degree in mathematics, statistics, data science, or quantitative/population genetics with a strong emphasis in statistics.SkillsStrong background and demonstrated excellence in statistics / data science.Useful knowledge: linear models, regularization/shrinkage, non-parametric models, model fitting, data munging. * Expert in R.Familiar with Unix-like environment, including basic scripting (bash, awk, sed).Curiosity and a desire to learn new things.Familiarity with genetics.DutiesDevelop statistical models relating crop performance to genetics and the environment.Develop tools to help plan and analyze field trials.Learn and apply new statistical/machine learning techniques.Conduct analyses to answer key strategic questions.Job Type: Full-timeEducation:Master's (Required)Location:Durham, NC 27701 (Preferred)Work authorization:United States (Required)", "link": "https://www.indeed.com/cmp/Hi-Fidelity-Genetics/jobs/Data-Scientist-2e421e82b337e630?vjs=3"},
{"title": "Data Scientist-Internship", "company": "TKXS", "location": "TKXS-Morrisville, NC 27560", "desc": "InternshipTKXS Data Science Summer Internship Opportunity\n\nTKXS is a leading provider of technology and data-driven services in the agriculture, healthcare and B2B/industrial verticals. We're looking for an Intern to join our Data Science Practice (DSP) for the summer to gain invaluable experience and help us explore some exciting analytic opportunities.\n\nJob Responsibilities:\n Work with structured and unstructured data to build new customer reports on purchasing behavior\n Utilize the scientific method and approach when coming up with modeling techniques\n Create predictive models on how current behavior could affect future outcomes\n Incorporate modeling solutions into current business systems that would be scalable for multiple customers\n Summarize results by creating visualizations in Tableau and presenting out to the team and larger audiences on your findings\n Collaborate with other team members and organizations to gather data and understand problem requirements\nDesired Qualifications:\n\nA rising Junior or Senior working towards a Bachelor’s degree in science, technology, engineering, data science or mathematics (STEM) related field, such as:\nStatistics\nOperations research\nMathematics\nExperience in statistical modeling\nFamiliarity with data manipulation in SQL and R/Python\nAbility to summarize results in software like Tableau or R and present findings\nMinimum Qualifications:\n\nFull-time student pursuing a Bachelor's degree in a technical field\nGPA of at least 3.0 on a 4-point scale\nAttending school on a full-time basis before/following this internship\nCreativity\nInitiative\nLeadership abilities\nProblem solving skills\nAbility to work in a diverse team environment\n Collaborate with other team members and organizations to gather data and understand problem requirements\nWhat we offer:\n\n A competitive hourly rate of pay\n The possibility of a Full time position after graduation\n A casual friendly work environment\n An excellent culture that fosters camaraderie and fun, while providing engaging intellectual challenges", "link": "https://www.indeed.com/viewjob?jk=92ef5a0bdbb3d450&from=serp&vjs=3"},
{"title": "Data Analyst, International", "company": "Bandwidth", "location": "Bandwidth20 reviews-Raleigh, NC 27616", "desc": "Who We Are:\nBandwidth lives for innovation! Our technology powers brands like Google, Microsoft, GoDaddy, Arlo, Netgear, Zoom, Rover and more of the most exciting leaders in technology. Our intelligent voice, messaging, 9-1-1 access, and phone number services— all backed by Bandwidth's own nationwide, all-IP voice network—allow us to power the way people communicate, connect, and do business.\n\nWhat We Are Looking For:\nThe Data Analyst, International works with the International team providing carrier cost evaluation and visibility dashboards, rate change and route updating visibility, capacity analysis, development of ILD rates to all countries (long tail) that reflect actual cost and traffic patterns, analysis of call completion and cost statistics, interface with TAC and NOC on traffic pattern changes and anomalies, develop customer proposals and customer rate deck preparation, build mechanism to update customer rate decks based on cost changes.\n\nWhat You'll Do:\n\nMonitor network data, to determine traffic and cost distributions daily.\nImplement programs to evaluate impact of rate changes and mechanism to update customer rate decks.\nWork with International team to develop custom and baseline International rate decks.\nCreate automated anomaly detection systems and consistently track cost and network performance.\nConduct thorough data mining using state-of-the-art methods.\nAnalyze and report on network and cost data with internal and third party sources of information.\nConduct data processing, cleansing, and verification of integrity of data used for analysis.\nSupport all ILD and overseas products.\n\nWhat You Need:\n\n3-5 years practical experience with data processing, database programming and data analytics\nBachelor's degree in Computer Science, Statistics, Applied Math, or related field.\nBig data tools such as Hadoop/MapReduce and its popular components. Database architectures, data models, query languages and reporting. Mathematical and visualization functions within databases and spreadsheets.\nMachine learning/AI techniques, features, and classifiers.\nProgramming and scripting; statistics skills, including distributions, statistical testing, and regression.\nExcellent pattern recognition and predictive modeling skills.\nProficiency conducting research and development of statistical learning models for data analysis. Excellent communication skills (written and oral).\n\nBonus Points:\n\nGraduate degree in Computer Science, Statistics, Applied Math, or related field\n2-3 years of data science/analytics or equivalent Military experience\n\"R\" software programming language\nCan build dashboards using near real-time data and build graphs/charts to visualize and alarm on near-real time data.\n\nThe Whole Person Promise:\nWe make a \"Whole Person\" promise to our team. You can have both meaningful work PLUS a full life at Bandwidth. We focus on accomplishing our mission as \"whole people.\" That means we take care of our people—in body, mind, and spirit.\n\n\nHealth: We pay 100% for benefits coverage including Medical, Dental, Vision, Prescription, Life, and Disability. Corporate chaplains, EAP and 401K match.\nFitness: 90-minute fitness lunch with a paid gym membership with shuttle service available for workouts. On-site cardio gym, locker room/showers, classes, and sponsored sports and leagues. Nutritionist and personal trainer on-site.\nVolunteer: We have a program dedicated to providing volunteer opportunities to employees, Bandwidthcares.\n\n", "link": "https://www.indeed.com/viewjob?jk=47f5252e7b4dae68&q=data+science&l=Research+Triangle+Park%2C+NC&from=web&advn=6826049403241636&sjdu=VyNrwcfTK15LupteTX0rmTRS_BxzuPaiMEa1y6sac4kTA6R_kO1Tgt7FOv47Pafpznt6tB7JDVG13vDW7smeig&acatk=1d002ler640gu800&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"title": "Data Leakage Protection Engineer", "company": "MPIRE Technology Group, Inc.", "location": "MPIRE Technology Group, Inc.-Raleigh, NC", "desc": "MPIRE Technology Group is seeking a Data Leakage Protection Engineerto join our team, supporting our client in Raleigh, NC. Candidates should have extensive experience in Symantec Data Leakage Protection (DLP) Incident Remediation and Policy Management and will need to provide data analysis to identify incident trends and patterns. Candidates with programming skills for improved automation arepreferred.Skills/Technologies:3 Years of Symantec and/or McAfee DLP operational experience is required; must have implemented and managedDLP program; must possess strong technical knowledge of DLP architecture, system policies, rules, etc. Coding/Scripting experience (e.g. Python, Perl, PowerShell)Proven experience with creating Regular ExpressionsExperience with RESTful APIs and automationKnowledge of data classification solutionsKnowledge of cryptographic implementations at media, file, and application levelsExperience with metadata management and data tagging and creating custom data analytics for data securityStrong verbal and written communications skills; must be able to effectively communicate technical details and thoughts in nontechnical/general terminology to various levels of the organization.Work well in team environments with internal and external resources as well as work independently on tasksStrong organizational, and time management skillsRequired:Bachelor’s Degree in ComputerScience, Information Technology or InformationSecurityAll candidates must be USCitizens, or have a permanent residence status(Green Card).Cannot have more than 6 monthsof travel outside the United States within the last five years. (Military Service excluded)Pass a client mandatedclearance process to include drug screening, criminalhistory check and credit checkOne or more of the following certifications are required:o CompTIASecurity +o CPTE– CertifiedPenetration Testing Engineero CEH - CertifiedEthical Hackero CISSP- CertifiedInformation SystemSecurity ProfessionalAble to obtain Postal clearanceNice to Have:Master’s Degree preferredOSCPCertificationCloud Access Security Broker (CASB) implementation and/or management experienceNext Generation Anti Malware implementation and/or management experienceThreat Intelligence administration experience; have used or implemented the above program in some capacity, understanding incident response, analysis, rules, etcExperience: Mid-SeniorLevel(7+years)Job Type: Full-timeExperience:Scripting: 1 year (Preferred)RESTFul APIs: 1 year (Required)Regular Expressions: 1 year (Required)Python: 1 year (Preferred)Symantec or McAFee DLP: 3 years (Required)Location:Raleigh, NC (Required)Work authorization:United States (Required)", "link": "https://www.indeed.com/cmp/MPIRE-Technology-Group,-Inc./jobs/Data-Leakage-Protection-Engineer-8c7570d7e828325f?sjdu=QwrRXKrqZ3CNX5W-O9jEvSFTw7VMruWlKNLDw1Yts3Zlo9Faw0yEQWfDQY_THTT9mE6Cq344roHdCi6V4pczFRctMy9B06wlU4WznVfvQ04&vjs=3"},
{"title": "Data Loss Protection Engineer", "company": "First Citizens Bank & Trust Company", "location": "First Citizens Bank & Trust Company858 reviews-Raleigh, NC 27602", "desc": "Position Description:\n\nAs a Data Loss Protection Engineer, you will be a member of the bank’s Information Security team. This role is responsible for articulating the architectural vision meeting information security requirements to protect Bank information assets, conceptualizing, defining, and evaluating alternate solutions and technologies. This position will lead efforts to develop and validate architecture and high-level solutions design against security and architectural requirements. Lastly, this individual will guide and mentor development teams/peers on methodologies, processes, and leading practices.\n\nThe position supports the people, process and technology used to deliver the Information Security Services. Program activities include:\nTechnical and Program focused architecture, design and implementation of the DLP Service.Vision, strategy, and roadmap for DLP to meet risk mitigation objectives.Evaluation of process and technology deployment of DLP controls and business need.Support, maintenance, or improvement of an existing DLP environment and program.\n\nPosition Requirements:\n\nBachelor’s degree with a minimum of 6 years of experience in systems engineering, networking or information security technologies, including at least 4 years of Symantec (or equivalent) DLP operational experience in an enterprise environment.\n-OR-\nHigh school diploma or GED with a minimum of 10 years of experience in systems engineering, networking or information security technologies, including at least 4 years of Symantec (or equivalent) DLP operational experience in an enterprise environment.\n\nAdditional Requirements:\nMust have implemented and managed DLP programMust possess strong technical knowledge of DLP architecture, system policies, rules, etc.Coding/Scripting experience (e.g. Python, Perl, PowerShell).Proven experience with creating Regular Expressions.Experience with RESTful APIs and automation.Knowledge of data classification solutions.Knowledge of cryptographic implementations at media, file, and application levels.Experience with metadata management and data tagging and creating custom data analytics for data security.Extensive experience in Symantec DLP Incident Remediation and Policy Management.Strong verbal and written communications skills.Work well in team environments with internal and external resources as well as work independently on tasks.Strong organizational and time management skills.Strong customer facing, interpersonal, and technical writing skillsThreat Intelligence administration experience; have used or implemented the above program in some capacity, understanding incident response, analysis, rules, etc.Programming skills for improved automation is preferred.Experience with Cloud and on Premise DLP implementation.\n\nOther Preferred Qualifications:\nFinancial services experience.Bachelor’s Degree in Computer Science or a technology discipline.Experience in a highly regulated industry sector (e.g. Government, Energy, Carrier-Telecommunications).Position relevant information security certifications (e.g. CISSP) and/or Symantec DLP Certification.Microsoft Data Protection solutions experience.", "link": "https://www.indeed.com/viewjob?jk=23fce32d316383ba&tk=1d002lf0l40gu800&from=serp&alid=3&advn=1665310439615105&sjdu=3j2yV1Cyo1TUbNt3be92UhUiWrWwqW_Iydx70fpDRmFQC5q5BAAOsvilp2d1iBMw"},
{"title": "Data Scientist", "company": "Covance", "location": "Covance846 reviews-Raleigh-Durham, NC", "desc": "Job Overview\nSupport the Clinical Informatics team with guidance from the Senior Data Scientists and above by applying business process knowledge and data analytics to support business decisions and objectives. The role requires the use of analytics to support the development of new, innovative solutions to business problems with the support of the Senior Data Scientists and above.\nStatistical Research & Model Development\nWorks under the supervision of the Senior Data Scientists to run and where necessary, modify or create programs to support the prototyping of tools.\nSupport software development to increase automation of modeling and forecasting processes.\nSupport with the supervision of the Senior Data Scientists and above the preparation of work instructions to run programs and tools.\nSupport under the supervision of the Senior Data Scientists and above the building of hypotheses, identifies research data attributes and determines best approach to address business issues.\nWorks internally and with clients to define, secure and prepare datasets for statistical modeling under the supervision of the Senior Data Scientists and above.\nExplores data under the supervision of the Senior Data Scientists and above by using a variety of statistical techniques to answer business questions or guide future model development.\nBuilds programs under the supervision of the Senior Data Scientists and above, for running statistical tests on data and for understanding correlation of various attributes.\nSupports development of experimental design for business initiatives under the supervision of the Senior Data Scientists and above.\nSupport the building predictive models needs under the supervision of the Senior Data Scientists and above.\nSupport the preparation of testing scenarios and tests model performance under the supervision of the Senior Data Scientists and above.\nModel Consultation, Implementation, & Communication\nConsults additional data sources to supplement existing data, including publically available information or internally available information under the supervision of the Senior Data Scientists and above.\nEffectively communicates under the supervision of the Senior Data Scientists and above, and delivers statistical and predictive model results to business partners, supporting socialization and adoption of analysis results into business activities and decisions.\nWorks closely with business stakeholders under the supervision of the Senior Data Scientists and above to identify and answer critical questions.\nEducation/Qualifications\nMA or MS in statistics subject, preferably with a strong medical statistics component or application of mathematical modelling component. (Alternative academic qualifications are assessed for comparability.)\nLevel of education preferred (if required or experience level which may be substituted for level of education).\nExperience\nKnowledge building predictive models utilizing advanced statistical analysis, including generalized linear models, decision trees, logistic and multivariate regression.\nKnowledge of writing automation code in various programming languages.\nAble to communicate business implications of complex data relationships and results of statistical models to multiple business partners.\nAbility to learn new programming languages or software packages and apply them in a self-directed manor.\nExperience with R, Python or SQL\nThe ability to plan and to adapt to changing situations.\nA professional approach at all times.\nMinimum Required:\nTwo Years of experience in other professional roles\nOther required work-related experiences", "link": "https://www.indeed.com/viewjob?jk=4e611c326e11ed57&from=serp&vjs=3"},
{"title": "Manufacturing Data Scientist", "company": "Thermo Fisher Scientific", "location": "Thermo Fisher Scientific2,151 reviews-Durham, NC 27702", "desc": "Job Description\nWhen you join us at Thermo Fisher Scientific, you’ll be part of a smart, driven team that shares your passion for exploration and discovery. With revenues of $22 billion and the largest investment in R&D in the industry, we give our people the resources and opportunities to make significant contributions to the world.\n\n\n\nHow Will You Make an Impact?\n\n\nIn this entry level role, the Manufacturing Data Scientist will be a key part of the technical staff supporting Biovia’s Discoverant Software system. Discoverant is a global network application enabling the Continued Process Verification (CPV) program, investigation analysis, continuous improvement, operational dash-boarding, process monitoring, and other operational functions. As a first priority, the Manufacturing Data Scientist will work with Thermo Fisher’s Discoverant Global Roll-out Team in support of the CPV program. The Discoverant system provides data aggregation from site and global data systems, data analysis, and reporting capability for the CPV process. Within this role, the Manufacturing Data Scientist will work with the global team and the manufacturing sites to design, develop, and implement Discoverant hierarchies across the manufacturing network\n\nWhat will you do?\nSupport technical staff through the Discoverant implementation roll-out at global manufacturing sites.\nWork with global manufacturing sites to define data needs of the organization.\nDemonstrate strong oral and written communication skills and leadership capabilities. Capable of working with global teams and different functions and levels effectively.\nUnderstand and use knowledge of systems and technologies in the manufacturing network that are directly and indirectly related to Discoverant to ensure the global Discoverant implementation is effective in its function and is leveraged for best impact.\nWork with global and local teams to develop best practices and make recommendations for best impact. May include recommendations and initiatives for additional third-party work, connectivity to other manufacturing, lab, and business systems, and establishing relevant tools, guidelines, and systems when needed.\nWork closely with other global functions and sites on initiatives or efforts related to Discoverant (ex: Global Process Validation, Automation, Quality, Continuous Process Verification leaders, Operational Excellence, others).\n\n\nHow will you get there?\n\n\nEducation\n\nBachelor’s degree in computer systems, engineering, biotechnology, statistics or similar field\n\n\nExperience\n\nEntry level role\nExperience with SQL, HTML, Java scripting, and Object-Oriented coding.\nBasic to moderate experience with database use and navigation.\nWorking knowledge of basic statistics including control charts, process capability, and statistical process control.\nWorking knowledge of the software development life cycle.\nHigh energy with good organizational skills.\nAbility to communicate in technical terms as well as communicating business / operational understanding and language.\nA strong problem, solver with solid analysis stills.\nThis position has not been approved for relocation assistance.\n\nAbout Thermo Fisher Scientific\n\nAt Thermo Fisher Scientific, each one of our 70,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular mission—enabling our customers to make the world healthier, cleaner and safer.\n\n\n\n\nThermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.\n\n\n\nIf you are an individual with a disability who requires reasonable accommodation to complete any part of our application process, click here for further assistance.\n\nThermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.", "link": "https://www.indeed.com/viewjob?jk=8f8aeda176f8b383&from=serp&vjs=3"},
{"title": "Data Scientist - Big Data", "company": "NTT DATA Services", "location": "NTT DATA Services1,684 reviews-Durham, NC", "desc": "Req ID: 32813\nAt NTT DATA Services, we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees are key factors in our company’s growth, market presence and our ability to help our clients stay a step ahead of the competition. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for NTT DATA Services and for the people who work here.\nNTT DATA Services currently seeks a Data Scientist - Big Data to join our team in Durham, North Carolina (US-NC), United States (US).\nDay to Day job Duties: (what this person will do on a daily/weekly basis)\nEvaluate trends, characterize factors, develop predictive models, and identify optimization opportunities.\nProvide accurate, timely, relevant and quality analysis that translate data into sound organizational decisions.\nResearch, design and prototype robust and scalable models based on machine learning, data mining, and statistical modeling to answer key business problems.\nBuild tools and support structures needed to analyze data, perform elements of data cleaning, feature selection and feature engineering and organize experiments in conjunction with best practices.\nWork with development teams & business groups to ensure models can be implemented as part of a delivered solution replicable across many clients.\nPresent findings to stakeholders to drive improvements and solutions from concept through to delivery.\n\nBasic Qualifications: (what are the skills required to this job with minimum years of experience on each)\nData Scientist-Hadoop: 3-5 years\nStrong skills in software prototyping and engineering with expertise in applicable programming and analytics languages (Python, R, C/C++) and various open source machine learning and analytics packages to generate deliverable modules and prototype demonstrations of their work\nSQL programming skills\nExperience with design and implementation of analytic models and methodologies for new applications.\nExperience with data visualization tools (e.g. Tableau)\nExperience with large and complex data sets\nDemonstrated ability to propose novel solutions to problems, performing experiments to show feasibility of their solutions and working to refine the solutions into a real-world context\nStrong analytical, written, and verbal communication skills\n\nTravel: Need Locals\nDegree: Bachelors in Computer Science or equivalent work experience\nDesirable Skills / Experience:\n\nPhD in computer science, computer engineering or MS with 3+ years of experience in related field.\nDeep knowledge of fundamentals of machine learning, data mining and statistical predictive modeling, and extensive experience applying these methods to real world problems\nDesired interdisciplinary skills include big data technologies, ETL, statistics and causal inference, Deep Learning, modeling and simulation\nBreadth of skills and experience in machine learning – diverse types of data, diverse data sources, different types of learning models, diverse learning settings\nExperience in Healthcare domain\nThis position is only available to those interested in direct staff employment opportunities with NTT DATA, Inc. or its subsidiaries. Please note, 1099 or corp-2-corp contractors or the equivalent will NOT be considered. We offer a full comprehensive benefits package that starts from your first day of employment.\nAbout NTT DATA Services\nNTT DATA Services partners with clients to navigate and simplify the modern complexities of business and technology, delivering the insights, solutions and outcomes that matter most. We deliver tangible business results by combining deep industry expertise with applied innovations in digital, cloud and automation across a comprehensive portfolio of consulting, applications, infrastructure and business process services.\nNTT DATA Services, headquartered in Plano, Texas, is a division of NTT DATA Corporation, a top 10 global business and IT services provider with 118,000+ professionals in more than 50 countries, and NTT Group, a partner to 88 percent of the Fortune 100. Visit nttdataservices.com to learn more.\nNTT DATA, Inc. (the “Company”) is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, gender identity, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result.", "link": "https://www.indeed.com/viewjob?jk=71be6c16d049a272&tk=1d002levp40gv800&from=serp&alid=3&advn=2454529721716050&sjdu=6ByzYMZLGYUgyrbSdN0cjDS0YJ0zhqMz6O3n9imrEhy6n5_c17FhDcYBcd683ubBNLJ8k5YoEK89MDAyFbysM0c5ZOWpU1JsL7Z2DrlU2jajUO-oB4fDDoMFbLlkpkuwc_90jrLAlJf0eKcnhNRgcHePmUVzYsmxsLfJ3MjijgXfTgYTaNcE-jJC4qiN53Jk5ZWTrPlz5HWD54EKtAm1ew"},
{"title": "Data Science", "company": "NetApp", "location": "NetApp627 reviews-Research Triangle Park, NC 27709", "desc": "Job Summary\n\n\nNetApp is looking for a Data Scientist focused on providing data-driven, action-oriented solutions to challenging business problems. Business-minded data scientist with a demonstrated ability to deliver valuable insight via data analytics and advanced data-driven methods. The ideal candidate is an independent, solution-oriented thinker with a strong background processing large data sets, applying analytical rigor and statistical methods, and driving towards actionable insights and novel solutions.\nSpecific Responsibilities\nAccountable for translating complex analytical concepts into actionable results\nDevelop predictive data models that will help to personalize interaction with business\nAnalyze and process complex data sets using advanced querying, visualization and analytic tools\nProduce appropriate and effective project deliverables\nDemonstrate a strong understanding of project scope, data extraction methodology, design of dependent and profile variables, logic and design of data cleaning, exploratory data analysis and statistical methods\nWork closely with Information Architect and business teams to understand the data from end to end perspective across business domains enterprise wide\nPartner with the Data Architect to build the optimal advance tools and self-service capabilities for the business units\n Day to Day\nDeveloping machine learning, optimization, or other modeling solutions as required\nDesign and develop reports/dashboards by interpreting the business, user, functional, and non-functional requirements\nProduct appropriate and effective project deliverables on problems such as, sample diagnostics, customer profiles, complex queries, data mining, model algorithms, charts, model score distributions, etc\nFind insights in large and fragmented data sets across database types and tools\nWork with multi-disciplined team taking full ownership of turning discoveries and ideas into models\n\n\n\nJob Requirements\n\nThe requirements listed below are representative of the knowledge, skill, and/or ability required to be a successful Data Scientist at NetApp.\nAbility to apply data science and data characterization technologies\nMust work across diverse project in a dynamic and collaborative environment\nConduct end to end analysis and apply novel solutions from the best of academia, open source, and commercial against our most challenging problems\nAssess and discover technology developments, determine relevance to project, and operationally prototype them against real work data and problems in actual code using agile development techniques\nInteract cross-functionally with a wide variety of people and identify opportunities to incorporate advanced analytics into existing workflows\nMust be current on technologies and systems and be able to explain them to audiences of all levels and functions\nMust be organized and analytical, adept at working in a team environment, able to design and implement a project schedule, and able to handle multiple priorities\nTechnology\nExperience with the following required:\nBroad understanding of statistical theory and application\nStatistical tools (R, R Studio, tidyverse, SQL Server R Services)\nETL development skills, Advanced T-SQL to support data collection, cleaning and validation\nAdvanced visualization training tools: Tableau, MS Power BI and others as they become available\nExperience with state-of-the-art techniques in machine learning algorithms, including deep neural networks, NLP, kernel methods, dimensionality reduction in supervised and unsupervised contexts, ensemble methods, network analysis.\nStrong analytical and data processing skills and comfortable working with large data sets and ability to transform data into actionable insights\nExceptional technical skills:\nStrong programming skills in at least one language such as Python, java, Scala, C++, Julia\nExperience with SQL and relational databases\nExperience with unstructured and semi-structured data sources and requisite processing tools\nAbility to work in an agile environment\nExperience using Hadoop, MapReduce, Spark and/or other distributed processing tool\n\n\n\n\nEducation\n\nGraduate degree in Mathematics, Statistics, CS, Data Science or a closely related education with 2+ years of experience in the IT industry with a focus on Statistics or Analytics\nExperience with common methods used in regression and classification problems (e.g. Random Forests, Support Vector machines, etc)\nExperience with Time Series Analysis, Survival Analysist, fixed and random effects, and developing models in contexts where observations are not IID\nKnowledge and experience with advanced statistical techniques and concepts (regression, properties of distributions, statistical tests, experimental design, and proper usage, etc)", "link": "https://www.indeed.com/viewjob?jk=bd92081f3304c237&from=serp&vjs=3"},
{"title": "Data Scientist", "company": "MetLife", "location": "MetLife3,949 reviews-Cary, NC 27513", "desc": "Job Location: United States : North Carolina : Cary\nRole Value Proposition:\nData Scientist – Research and Development, Innovation\nThe Center of Excellence in Analytics is a group of data scientists whose goal is to provide mathematically and statistically based insight to major decision-based processes at MetLife. This organization includes a specialist group which focuses in efficacy: researching, developing, and deploying analytical methods which will help to transform MetLife. As a Data Scientist focused in research and development, your job will fall into these major tasks:\nAnalytics Feature Research and Development\nCreate new analytical techniques to address the needs of MetLife.\nFirst-of-a-Kind Analytics Problem Delivery\nBe the first to solve new problems to MetLife using cutting edge techniques.\nAdvisory Services to Delivery Teams\nProvide mentorship and advise to data scientists on project work, ensuring quality and value.\nEvaluate new technologies and Services\nBecome an expert in an area of analytics and where applicable provide expert opinions on new technology that can be implemented across the company.\nAs a data scientist in a global division, you will additionally collaborate with regional and local teams, creating best practices for common analytical projects, and delivering value across the globe.\nKey Responsibilities:\nDevelop analytical features which will provide the greatest value to the company.\nDeliver cutting edge approaches through first-of-a-kind solutions to transform our decision processes.\nDevelop associate data scientist talent, and advise on current project work.\nBuild collaboration and awareness in global analytics community.\nAssist in the determination of necessary technology to transform MetLife.\nEssential Business Experience and Technical Skills:\nRequired:\n\nMasters or Doctorate in Quantitative Field (Physics, Math, Statistics, Operations Research, Engineering, Actuarial Science, etc.)\n 2 years of experience as a data scientist/quantitative researcher/algorithmic ( 1 years for doctorate level)\nProgramming proficiency in at least Python (version 3.) with a preference towards also having proficiency in SAS as well.\nHigh proficiency in classical statistical and mathematical modeling methods required.\nPreferred:\nKnowledge of actuarial science, insurance, or risk management modeling.\nAt MetLife, we’re leading the global transformation of an industry we’ve long defined. United in purpose, diverse in perspective, we’re dedicated to making a difference in the lives of our customers.\nMetLife is a proud equal opportunity/affirmative action employer committed to attracting, retaining, and maximizing the performance of a diverse and inclusive workforce. It is MetLife's policy to ensure equal employment opportunity without discrimination or harassment based on race, color, religion, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity or expression, age, disability, national origin, marital or domestic/civil partnership status, genetic information, citizenship status, uniformed service member or veteran status, or any other characteristic protected by law.\nMetLife maintains a drug-free workplace.\nFor immediate consideration, click the Apply Now button. You will be directed to complete an on-line profile. Upon completion, you will receive an automated confirmation email verifying you have successfully applied to the job.\nRequisition #: 105523", "link": "https://www.indeed.com/viewjob?jk=2735279bc1ce749b&from=serp&vjs=3"},
{"title": "Data Scientist", "company": "Veritude", "location": "Veritude101 reviews-Durham, NC", "desc": "TemporaryVeritude is seeking Data Scientist for Fidelity Investments. This position is based in Durham, NC.\n\nAbout Fidelity Labs\nFidelity Labs incubates internal startups—made up of product managers, designers, developers and marketers—that are tasked with creating new business that drive growth and deliver on Fidelity's mission. Our teams' passion combined with human-centered design and agile methodologies are responsible for driving industry transformation and customer impact at scale. See what we’re up to at www.FidelityLabs.com.\n\nThe Expertise We’re Looking For\n\nIf you are driven by the numbers and have a passion for diving into data and extracting that will impact business and marketing decisions, this job is for you. In addition to the below, the ideal candidate will have strong communication skills and the ability to work collaboratively across teams.\n\n\nDegree in Analytics, IT, Economics or related field (Advanced Technical or Business Degree a plus)\n5+ years of data management and marketing experience, with 2+ years direct experience with data management in a cloud environment either in an eCommerce environment or for a Database Management/Customer Insights firm .\nStrong data analytics expertise, including experience translating customer KPIs into actionable marketing strategies that drive growth.\nExperience with data analytics tools and technologies across data (Google Analytics, Omniture, SQL, R, SAS, Python), visualization (Tableau, QlikView, or PowerBI))\nExperience with data warehouses, Big Data and Data Lakes a plus\nExperience with Lean Startup, Design Thinking, and Agile Methodologies preferred\n\nThe Purpose of Your Role\nThe Data Scientist is a key role on the Go To Market team where you will work closely with our Growth Hackers, Technologists, Operations and Product Managers to understand their business needs and relationship to the marketing data and insights. Through measured tactics, and validated strategies you will contribute to the success of our internal startups by providing high quality data analysis that turn insights into actionable recommendations to drive customer lifetime value, business results and growth for small to medium sized selfcontained projects. This role is based in Boston, MA or Durham, NC\n\nThe Skills Your Bring\nData Extraction, Analysis and Ongoing Customer Data Management\nCollaborate to build an end-to-end, extendable customer data solution from defining requirements to data migration and creation of dashboards, ensuring data integrity, accuracy and compliance. As needed, ensure that our services provider has the appropriate functional and technical specifications, direction and resources to deliver the solution.\n\n• Own overall omni-channel customer data management approach with IT, including post-launch maintenance and enhancements. Collaborate with Go To Market, Technologists, Operations, Product, technology and other functional teams as needed around data management & quality, data governance, and data requirements.\nBe part of the team the helps define the digital marketing ecosystem/roadmap and delivers a marketing technology stack that is scalable, extendable, and uses consumer data to enhance the consumer journey and drives brand and business growth. Work with key stakeholders to help define an integrated digital marketing analytics and attribution approach.\nCustomer Insights & Segmentation Strategy\n\n• Collaborate with key analytics stakeholders, leading data analytics development and segmentation analysis. Define and deliver our customer insights approach and reporting capabilities that ultimately drive long-term consumer relationships\nManage the insights coming from customer data to tell stories – ones that turn insights into actionable recommendations that drive customer lifetime value, business results and growth.\nWork with multiple teams to develop a customer’s journey, experience and lifecycle strategies for key customer groups and audience segments. Identify opportunities throughout the consumer journey to increase customer acquisition, conversion and retention that will help drive and influence email, social, advertising, and site strategies.\nHelp develop the brand’s personalization and audience management strategy across the consumer journey, including email, site, and digital marketing.\nWork with teams to advise on A/B and multivariate testing approaches as well as control group and segments management.\n\nThe Value You Deliver\n\n• Expertise in analytical insights, measured tactics, and validated strategies to turn data analysis into actionable recommendations.\nStrong understanding around how big data is influencing customer analytics and the consumer journey, with an ability to pivot with change and pinpoint growth opportunities through customer centricity.\nStrong understanding of customer lifecycle marketing, segmentation, testing, and optimization strategies and a knowledge of marketing/cloud technologies, preferably Salesforce Marketing Cloud\nExcellent communication, collaboration, and planning skills; demonstrated success in communicating ideas to various stakeholders\nPrioritizes workload, managing multiple and often competing tasks, and meets deadlines for various and fluctuating marketing deliverables\nAbility to identify the metrics to drive success, measure KPIs, socialize understanding and drive initiatives to completion\nOutstanding team player and positive attitude, with a strong sense of ownership and accountability\n\nHow Your Work Impacts the Organization\n\nFidelity Labs’ mission to create new businesses that drive growth and deliver on Fidelity’s mission to inspire better futures and deliver better outcomes for the customers and businesses we serve. Our focus is on important financial “jobs to be done,” where people and organizations are experiencing real issues and where we believe we can help. We believe in creating impact at scale and meaningfully improving the lives of the people we serve. Company Overview\n\nAt Fidelity, we are focused on making our financial expertise broadly accessible and effective in helping people live the lives they want. We are a privately held company that places a high degree of value in creating and nurturing a work environment that attracts the best talent and reflects our commitment to our associates. For information about working at Fidelity, visit FidelityCareers.com\n\nFidelity Investments is an equal opportunity employer", "link": "https://www.indeed.com/viewjob?jk=260eff05c2caf33f&tk=1d002lf3240gv800&from=serp&alid=3&advn=2738627601089396&sjdu=ws-YkYAWZS_RuAPOjvjipFSAoM0BvT4sbrI7SuuJE1Y-F4oooDbzsIwnYxme6Tl5vAE5bZnhKTV59tV6tcPxBA"},
{"title": "Data Engineer", "company": "State of North Carolina", "location": "State of North Carolina208 reviews-Wake County, NC", "desc": "$61,972 - $100,892 a yearRecruitment Range: $61,972.00 - $88,000.00 Pay Grade: IT06\nAt the North Carolina Department of Revenue we have the mission of administering the tax laws and collecting taxes due to the State in an impartial, uniform, and efficient manner. Our vision is to be better today than we were yesterday, make a difference every day while achieving excellence and ensuring public trust. Strategically our goal is to focus on the taxpayer and make it easy to comply with the law. Through modernization efforts in technology we believe we've set a high standard that other revenue agencies will admire. As an employer, we offer excellent benefits, stable work environment, competitive salaries, defined career paths, and training programs that will enable you to be successful.\n\nThe North Carolina Department of Revenue is seeking a self-starter Data Engineer that will be able to support our Business Intelligence initiatives. The Data Engineer will work with a team of IT professionals and provide support to business units serving as a core member of an engineering team that designs and develops software applications/packages/components focused on data warehousing.\n\nThe work to be performed is identified and prioritized by the Department's business divisions and is implemented using structured project and SDLC methodologies using the ITIL framework.\n\nPosition will participate in end-to-end customer analytic requirements gathering, including identifying data analysis needs as well as processing and exploring system data.\nPosition will translate business requirements into analytic methods, build models, develop reports, and present reports to customers.\nDevelop code and unit tests, working on API specs, automation, and conducting code reviews and testing.\nPosition will create and execute test scripts, and document findings. Position will provide daily operational support to customers.\nReviewing data structure of the data warehouse.\nAdvance the organizational understanding of available data, incorporating it into improving our view of the world.\nAdvocate innovative uses for data, including methodologies, techniques, and tools.\n Define and maintain development practices that let us move fast with quality - including writing tests and documenting key implementations.\n Assist with continually enhancing operational excellence - deployment, migrations, uptime, performance, etc.\nOn Call Support.\n\nKnowledge, Skills and Abilities / Competencies\n\nBS or MS degree in computer science, computer engineering or other technical discipline, or equivalent work experience.\nDemonstrated knowledge of programming languages, e.g. SQL, Oracle, and JAVA.\nDemonstrated administration skills on Oracle databases.\nETL experience and expertise with Linux/Unix.\nExperience with JavaScript or Java API development.\nThorough knowledge and understanding of business systems theories, processes, rules and regulations and how they apply to technology in the applicable area(s).\nDemonstrated experience in application design, software development, testing, and working with systems processing event-based logs, user logs, and debugging of complex systems.\nAbility to maintain ongoing interaction with internal and external audiences using written and verbal communication skills.\nDesign and implement systems for providing data to stakeholders, ensuring correctness and consistency.\nManagement Preferences:\nThree or more years of IT work experience with SAS, Access, Oracle, or JAVA development.\n5+ years of experience administering other database platforms such as Oracle is a plus working with large-scale data in a production environment.\nDevelopment and support experience in Oracle, PL/SQL\nApplication Server Support Experience in Unix/Linux\nDevelopment and support experience in Java\nAbility to write queries and pull data from DB\nAptitude for learning and applying programming concepts.\nITIL Foundations Certification is preferred.\n\nMinimum Education and Experience Requirements\nBachelor's degree in Computer Science, Computer Information Systems, Computer Engineering, Math, or Engineering or related technical degree from an appropriately accredited institution and two years of experience in business application consulting or development; or Bachelor's degree with some computer coursework from an appropriately accredited institution and three years of experience in business applications consulting or development; or Associate's degree in computer programming from an appropriately accredited institution and three years of experience in application consulting or development; or an equivalent", "link": "https://www.indeed.com/viewjob?jk=cda1c64f985c41a9&from=serp&vjs=3"},
{"title": "Data Analyst", "company": "FMI Corporation", "location": "FMI Corporation10 reviews-Raleigh, NC 27612", "desc": "Overview\nFMI’s Management Consulting Analytics team is seeking a high-energy, self-motivated Data Analyst with demonstrated quantitative and analytical skills to join its growing team.This full-time position will be based in our downtown Raleigh, North Carolina corporate headquarters.\nThe data analyst will be responsible for compiling and synthesizing company financials and related operations and performance data into custom-formatted data reports.\nResponsibilities\nDeveloping and implementing data analyses, data collection systems, and other strategies that optimize statistical efficiency and quality\nAcquiring data from primary or secondary data sources and maintain databases\nWorking with management team to create a prioritized list of needs for our clients and the Analytics team\nUsing data to create models that depict trends in client performance and the population as a whole\nWorking with the Data Analytics Manager to outline the specific data needs for analysis projects\nQualifications\nBachelor’s degree from an accredited college or university in accounting, business, finance, computer science, statistics, data science or related field\nDemonstrated database and data mining experience\nSuperior organizational, time management and project management skills, and the ability to exercise sound independent judgment\nDemonstrated maturity, integrity and the ability to work in an ambiguous entrepreneurial environment, both individually and as a team player\nHigh attention to detail\nExcellent written and verbal communication, listening, problem solving, interpersonal and relationship-building skills\nStrong proficiency with Microsoft Office: Word, Excel, PowerPoint\nPrevious experience with Tableau a plus", "link": "https://www.indeed.com/viewjob?jk=22b5cf9f8da1ba6a&from=serp&vjs=3"},
{"title": "Senior Data Scientist – Full-Time Associate", "company": "Cigna", "location": "Cigna3,361 reviews-Raleigh, NC 27607", "desc": "It's fun to work in a company where people truly BELIEVE in what they are doing!\n\n\nWe're committed to bringing passion and customer focus to the business.\n\n\nSenior Data Scientist – Full-Time Associate\n\nWhat you’ll do: Improve the lives of others using Big data!\nCigna’s Data Science team uses Hadoop/Hive SQL along with Python/Jupyter/R/SAS to find actionable insights that lead to more efficient and higher quality care, as well as improve provider and patient satisfaction. We are looking for someone as passionate as we are about delivering innovative insights, predictive models, and program evaluations to support our programs. This person can independently complete rigorous research tasks but also enjoys collaborating with other data scientists and non-technical partners.\nWhat you need to do the job:\nPerform advanced analytics (multilevel modeling, generalized liner models, case/control matching): “ what happened?”\nConduct key driver analysis: “ why did it happen?”\nEnthusiastically share insights with internal and external non-technical partners: “why does this matter?”\nLead deployment of innovative solutions and ensure data driven decisions lead to action: “ what can we do differently?”\nInnate curiosity and drive to continually learn new techniques and innovate: “how can we provide better insights?”\nRole Summary:\nThis person will conduct advanced analytics to generate actionable insights for our value-based programs.\nResponsibilities:\nProvide actionable insights to provider/clinical partners and leadership by:\nQuerying healthcare data (claims, clinical, pharmacy, externally sourced) in Hadoop.\nUsing advanced statistical and Bayesian analysis including risk adjustment, episode analytics, predictive modeling, power analysis, matched case control studies, etc.\nSupporting Information Management/Technology as they automate solutions.\nPresenting findings and data-driven recommendations to non-technical business partners and leadership, submitting innovative research to national/international conferences and peer-reviewed journals.\nSupervising, coaching, and developing colleagues\n\nLocations:\nRaleigh, NC\n\nIs this opportunity is right for you? Please visit www.Cigna.com/careers and apply to job ID 18008459.\n\nUS Candidates Only: This position is not eligible for visa sponsorship by the company, and therefore is open only to individuals who are eligible for employment in the United States and who would not require visa sponsorship now or in the future.\nQualified applicants will be considered for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, disability, veteran status. If you require a special accommodation, please visit our Careers website or contact us at SeeYourself@cigna.com .\n\nQualified applicants will be considered for employment without regard to age, race, color, religion, national origin, sex, sexual orientation, gender identity, disability, veteran status.\n.\nIf you require an accommodation based on your physical or mental disability please email: SeeYourself@cigna.com. Do not email SeeYourself@cigna.com for an update on your application or to provide your resume as you will not receive a response.", "link": "https://www.indeed.com/viewjob?jk=6fea325e26bc7822&from=serp&vjs=3"},
{"title": "Engineering Data Analyst", "company": "CREE", "location": "CREE343 reviews-Durham, NC 27703", "desc": "Job Description\nCree – Engineering Data Analyst – Reliability and Characterization\nJob Summary\nCree currently has an opening for an Engineering Data Analyst within the LED Components R&D group at our headquarters facility in Raleigh/Durham, NC. We are looking for a self-motivated, hands-on candidate to become a member of the ISO:17025 accredited Reliability and Characterization Lab and help drive Cree’s leadership in LED development.\nThe successful candidate will be someone who can process large datasets in order to make inferences and predictions regarding real life applications. Organization and high level analytical skills will be paramount as they work with the Development teams to drive better LED performance.\nWhat can Cree do for you?\nIn this role, you will be instrumental in shaping the methods, tools and mindset for data-driven device evaluation and long-term performance predictions\nLocated in the thriving Research Triangle region of North Carolina, including locations that have been named best place to live in the entire U.S.\nPotential for future mobility within a strong growth-oriented company and a technology leader in LED devices\nBeing part of a strong technical team that values agility, contribution and independence\nWhat can you do for Cree?\nAnalyze data using sound statistical methodology to drive developments, improvements and make recommendations\nManage and summarize datasets in order to project future performance critical for development decisions and customer evaluations\nAs a member of the Development Team, you will interact with a wide range of functional groups including Manufacturing, Purchasing, Facilities, Quality, Applications, and Marketing.\nWhat you need for success:\nBS in Data Science, Materials Science, Mechanical Engineering, Chemical Engineering, Applied Physics or other relevant Physical Science major.\n3 to 5 years’ experience in semiconductor manufacturing, reliability testing or device characterization\nExperience with databases and data analysis tools (SQL, Access, SAS JMP, Excel, etc.)\nExcellent written and verbal communication skills along with strong interpersonal skills\nStrong problem-solving abilities.\nExcellent computer and data analysis skills.\nHighly preferred skills and certifications:\nMS in Data Science, Materials Science, Mechanical Engineering, Chemical Engineering, Applied Physics or other relevant Physical Science major.\n5+ years’ experience in semiconductor manufacturing, reliability testing or device characterization is preferred but not required.\nExperience with industry quality standards or similar quality experience.\nExperience in semiconductor device and/or failure analysis.\nOverview\nAt Cree, we’ve spent more than 30 years developing industry firsts as a leader in wide bandgap semiconductor technology. Not familiar with all of our products? That is because we are a part of the invisible revolution; if we do our job right you will never know we were there. Our products make impossible possible like our LEDs that power cities to our Silicon Carbide (SiC) and Gallium Nitride (GaN) components that power electric vehicles, solar energy, telecommunications and industrial, military and aerospace solutions.\n\nWe believe in enabling the world to do more with less. That’s why we encourage each other to think unconventionally, take ownership and solve real problems. Interested in a career at Cree? We want to meet you. Submit your application now.\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability status, protected veteran status, or any other characteristic protected by law.", "link": "https://www.indeed.com/viewjob?jk=40a12317737d8a6d&from=serp&vjs=3"},
{"title": "Data Analyst", "company": "Resolvit, LLC", "location": "Resolvit, LLC29 reviews-Raleigh, NC", "desc": "RESOLVIT\nBringing Solutions That Make Business Better\nWe are seeking a Data Analyst to be part of a creative, forward-thinking team. Our success at deploying skilled, highly knowledgeable experts has landed us on the Inc. 5000 list of America’s fastest-growing companies four times – and we’re just getting started.\nAs the Data Analyst, you will help cross-functional teams make better data driven decisions by turning 1s and 0s into intuitive reports and visualizations. You will analyze data, learn new tools, try new approaches, and ultimately provide your team with an output that helps them work more efficiently. You will also review existing reports and visualizations for correctness and ways to improve.\nWhat You’ll Need to be Successful:\n2 years of relevant experience\nBachelor’s degree or equivalent experience\nProficiency with statistical programming\nExperience with data visualization tools\nA good understanding of PaaS and IaaS solutions\nComfortable with big data concepts\nAbility to work independently to identify problems and seek resolutions\nWillingness to find creative ways to solve problems\nAn understanding of why teamwork, culture, and constructive conflict are important\nComfort with a fast-paced, fluid workplace\nAbility to explain data science concepts and results to people with different technical proficiencies\nAbility to implement the 80/20 rule effectively\nDetail oriented and organized\nWe currently have more than 100 open career opportunities across the country, so be sure to mention the appropriate Job Code with any correspondence!\nAbout Resolvit:\nResolvit is an international technology consulting firm with industry-leading customers in the financial services, high tech, manufacturing, retail, life sciences, and government sectors. Through its partnerships, Resolvit delivers highly impactful, innovative solutions across five core areas: Infrastructure Modernization, Application Development Services, Enterprise Data Management & Analytics, Knowledge & Content Management, and Strategic Staffing.", "link": "https://www.indeed.com/viewjob?jk=bc40266c0c676080&from=serp&vjs=3"},
{"title": "Financial Data Scientist", "company": "Lenovo", "location": "Lenovo873 reviews-Raleigh, NC 27616", "desc": "Functional Area: University Facility: Corporate Office Relocation Provided: No Education Required: Masters Degree Experience Required: 1 - 3 Years Travel Percent: 0 **Position Description** Lenovo is currently seeking a Financial Data Scientist to join our North America PC and Smart Device finance team in Morrisville, North Carolina. The data scientist will be responsible for partnering with our commercial channel sales organization to optimize financial performance through the use of data analytics including statistical modeling and data visualization. This role will also serve as the primary liaison between the North America finance team and sales and operations teams to help support and drive multiple strategic business transformation projects utilizing big data, AI, and machine learning. The successful candidate will have opportunity to leverage this position to establish a strong knowledge foundation of the North America PC and smart device business in order to be well positioned for future leadership roles in finance or operations. **Position Requirements** Requirements: \\- Masters degree in Data Analytics or equivalent \\- 3+ years work experience in finance/accounting or analytics roles \\- Strong written and verbal communication skills with ability to interpret and explain analytic models \\- Demonstrated accountability for owning tasks and delivering the desired future outcomes \\- Proficiency in Microsoft Office: Word, Excel, Powerpoint \\- Experience with database management/processing (SQL, etc.) and visualization tools (Qliksense, etc.) a plus \\- Preferred undergraduate degree Business/Finance/Accounting We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. -", "link": "https://www.indeed.com/viewjob?jk=ebcd8907c961def0&from=serp&vjs=3"},
{"title": "Data Scientist III", "company": "LexisNexis", "location": "LexisNexis796 reviews-Raleigh, NC 27615", "desc": "Data Scientist III\nAt LexisNexis, we develop the legal profession?s most innovative products for data analysis, visualization, and research - uncovering insights about judges? rulings, revealing critical cases, enabling lawyers to make data-driven decisions, and more. LexisNexis seeks a Senior Data Scientist to join our rapidly growing team. As a senior member of the Data Science team, you will design systems to tackle tough problems in the legal domain and expand our award-winning products.\nACCOUNTABILITIES\nEvaluate, fix, and help in the maintenance our data assets and training/evaluation data sets\nDevelop and implement scalable machine learning-based solutions\nPariticpate in model reviews with key stakeholders, including stakeholders with limited statistical backgrounds from among that set\nWork with product leaders to apply data science solutions\nMaintain current knowledge-base of best-in-class algorithms, API's, and open-source methods and be able to quickly evaluate alternatives\nTranslate complex business requirements into actionable stories with reasonable time estimates\nParticipate in knowledge sharing sessions (e.g. Guilds and Chapters)\nDATA SCIENCE AND NLP SKILLS\nFormal training in dimensionality reduction, clustering, and sequence classification algorithms\n3+ years experience using Machine Learning package ScikitLearn\n3+ years experience using NLP methods such as OpenNLP, StanfordNLP, Mallet, LDA, word2vec\nPROGRAMMING SKILLS\n\n3+ years recent coding experience using Python AND/OR (Java OR Scala)\nSQL programming experience\n CLOUD AND DATABASE SKILLS\n\n1-3 years experience developing in AWS\n1-3 years experience working in high-performance / large-scale (big data) computing systems (e.g Hadoop, Spark)\n TEAM AND SOCIAL SKILLS\n\nStrong collaboration and team skills (DIR/MGR)\n\nLexisNexis Legal & Professional (www.lexisnexis.com) is a leading global provider of content and technology solutions that enable professionals in legal, corporate, tax, government, academic and non-profit organizations to make informed decisions and achieve better business outcomes. As a digital pioneer, the company was the first to bring legal and business information online with its Lexis and Nexis services. Today, LexisNexis Legal & Professional harnesses leading-edge technology and world-class content, to help professionals work in faster, easier and more effective ways. Through close collaboration with its customers, the company ensures organizations can leverage its solutions to reduce risk, improve productivity, increase profitability and grow their business. Part of RELX Group plc, LexisNexis Legal & Professional serves customers in more than 100 countries with 10,000 employees worldwide. LexisNexis, a division of RELX Group, is an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law. If a qualified individual with a disability or disabled veteran needs a reasonable accommodation to use or access our online system, that individual should please contact 1.877.734.1938 or accommodations@relx.com.", "link": "https://www.indeed.com/viewjob?jk=2fb53779efc7967f&from=serp&vjs=3"},
{"title": "Developer Advocate, Data Science Education", "company": "Google", "location": "Google2,734 reviews-Chapel Hill, NC 27516", "desc": "Note: By applying to this position your application is automatically submitted to the following locations: Boulder, CO, USA; Austin, TX, USA; Chapel Hill, NC, USA; Cambridge, MA, USA; Chicago, IL, USA; Irvine, CA, USA; Kirkland, WA, USA; Los Angeles, CA, USA; New York, NY, USA; Seattle, WA, USA; San Francisco, CA, USA; Sunnyvale, CA, USA\nQualifications\nMinimum qualifications:\n\nBachelor's degree in Computer Science, related technical field, or equivalent practical experience.\n3 years of experience in coding with Python.\n2 years of experience in data science with an emphasis on machine learning.\nExperience engaging with online learning communities through competition participation, dataset publishing, kernel authorship, or a combination of the three.\n\nPreferred qualifications:\n\nExperience in all major branches of data science (i.e., deep learning, exploratory data analysis, data visualization, GLM-style modeling, etc.).\nExperience teaching data science skills to students, colleagues, or the general public.\nExperience applying data science principles to solve real-world problem.\nExcellent communication skills.\nAbout the job\n\nKaggle is a data science community where users come to learn and improve their skills. Kaggle Learn is a platform that provides free data science courses to a rapidly growing community. Our team is geographically distributed across North American and Eastern Australia.\nAs a Developer Advocate, you will play a key role in the growth of Kaggle by creating new courses and improving existing ones. You will support aspiring and existing data scientist with new material and enable users to make the most out of Kaggle's repository and public notebook, Kernels.\nResponsibilities\n\nCreate free, fast-paced data science courses for Kaggle.\nDesign well-structured courses on major data science topics.\nWrite short explanatory tutorials.\nWrite hands-on exercises to build and test user's knowledge of course content.\nWrite Python code that gives feedback to users in response to their exercise solutions.\nLocation\n\n\n\nChapel Hill, NC, USA\n\nAt Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by emailing candidateaccommodations@google.com.\nTo all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other organization location. Google is not responsible for any fees related to unsolicited resumes.", "link": "https://www.indeed.com/viewjob?jk=61e881a747ba4729&from=serp&vjs=3"},
{"title": "Data Analyst, International", "company": "Bandwidth", "location": "Bandwidth20 reviews-Raleigh, NC 27616", "desc": "Who We Are:\nBandwidth lives for innovation! Our technology powers brands like Google, Microsoft, GoDaddy, Arlo, Netgear, Zoom, Rover and more of the most exciting leaders in technology. Our intelligent voice, messaging, 9-1-1 access, and phone number services— all backed by Bandwidth's own nationwide, all-IP voice network—allow us to power the way people communicate, connect, and do business.\n\nWhat We Are Looking For:\nThe Data Analyst, International works with the International team providing carrier cost evaluation and visibility dashboards, rate change and route updating visibility, capacity analysis, development of ILD rates to all countries (long tail) that reflect actual cost and traffic patterns, analysis of call completion and cost statistics, interface with TAC and NOC on traffic pattern changes and anomalies, develop customer proposals and customer rate deck preparation, build mechanism to update customer rate decks based on cost changes.\n\nWhat You'll Do:\n\nMonitor network data, to determine traffic and cost distributions daily.\nImplement programs to evaluate impact of rate changes and mechanism to update customer rate decks.\nWork with International team to develop custom and baseline International rate decks.\nCreate automated anomaly detection systems and consistently track cost and network performance.\nConduct thorough data mining using state-of-the-art methods.\nAnalyze and report on network and cost data with internal and third party sources of information.\nConduct data processing, cleansing, and verification of integrity of data used for analysis.\nSupport all ILD and overseas products.\n\nWhat You Need:\n\n3-5 years practical experience with data processing, database programming and data analytics\nBachelor's degree in Computer Science, Statistics, Applied Math, or related field.\nBig data tools such as Hadoop/MapReduce and its popular components. Database architectures, data models, query languages and reporting. Mathematical and visualization functions within databases and spreadsheets.\nMachine learning/AI techniques, features, and classifiers.\nProgramming and scripting; statistics skills, including distributions, statistical testing, and regression.\nExcellent pattern recognition and predictive modeling skills.\nProficiency conducting research and development of statistical learning models for data analysis. Excellent communication skills (written and oral).\n\nBonus Points:\n\nGraduate degree in Computer Science, Statistics, Applied Math, or related field\n2-3 years of data science/analytics or equivalent Military experience\n\"R\" software programming language\nCan build dashboards using near real-time data and build graphs/charts to visualize and alarm on near-real time data.\n\nThe Whole Person Promise:\nWe make a \"Whole Person\" promise to our team. You can have both meaningful work PLUS a full life at Bandwidth. We focus on accomplishing our mission as \"whole people.\" That means we take care of our people—in body, mind, and spirit.\n\n\nHealth: We pay 100% for benefits coverage including Medical, Dental, Vision, Prescription, Life, and Disability. Corporate chaplains, EAP and 401K match.\nFitness: 90-minute fitness lunch with a paid gym membership with shuttle service available for workouts. On-site cardio gym, locker room/showers, classes, and sponsored sports and leagues. Nutritionist and personal trainer on-site.\nVolunteer: We have a program dedicated to providing volunteer opportunities to employees, Bandwidthcares.\n\n", "link": "https://www.indeed.com/viewjob?jk=47f5252e7b4dae68&q=data+science&l=Research+Triangle+Park%2C+NC&from=web&advn=6826049403241636&sjdu=VyNrwcfTK15LupteTX0rmTRS_BxzuPaiMEa1y6sac4kTA6R_kO1Tgt7FOv47Pafpznt6tB7JDVG13vDW7smeig&acatk=1d002lg5s40gv802&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"title": "Business Analyst / Data Scientist", "company": "Covance", "location": "Covance846 reviews-Raleigh-Durham, NC", "desc": "Job Overview\nThe Associate is a member of the Xcellerate Monitoring Integration and Configuration Services (XMICS) team, supporting execution of key Risk Based Monitoring (RBM) tool standard configuration and customization activities and operates as a supporting XMICS Analyst for assigned studies.\nThe Associate collaborates with the study team to set up central monitoring tools and dashboards to comply with the central monitoring configuration plans.\nThe Associate requires working knowledge of one or more areas of programming (e.g. clinical data structures and mapping, tool configuration and JSON, JavaScript or HTML5 programming) as well as an understanding of broader drug development and clinical trials. He/she is responsible for accurate and timely uploading of operational and clinical trial data and refresh of central monitoring dashboards and tools.\nEssential Job Duties:\nSupport Lead XMICS Analysts for studies\nPerform standard study configuration and study testing in at least one Xcellerate® Monitoring tool (Xcellerate Risk Review, Xcellerate Medical Review (XMR), Xcellerate Statistical Review (XSR) or Xcellerate Data Review (XDR)) (30%)\nPerform Xcellerate Risk & Issue Management (XRIM) study testing\nSupport development of export programs at least one of Xcellerate® Monitoring tools\nPerform testing of study specific data sources, risk indicators & visualizations (10%)\nPerform regular data loading into Study Data Warehouse (SDW) (20%)\nSupport resolution of helpdesk calls\nPerform maintenance and update of standards in at least one Xcellerate Monitoring tool (10%)\nPerform exception review and error analysis of SDW data loading (20%)\nProduce eTMF artefacts during study from Xcellerate Monitoring tools\nProduce final eTMF artefacts during study closure from Xcellerate Monitoring tools\nPerform dataset extraction for long term storage\nEducation/Qualifications\nRecommended:\nUniversity degree education preferred in science, mathematics or computer science.\n\nExperience\nMinimum Required:\nProficiency with relational databases and SQL\nSome understanding of algorithms and their scalability\nProgramming skills in 1 of the following; SAS, C#, C++, R, Matlab or equivalent\nNo experience of risk management, risk based monitoring or central monitoring is required.", "link": "https://www.indeed.com/viewjob?jk=56a3ee8057d6deb2&from=serp&vjs=3"},
{"title": "Data Loss Protection Engineer", "company": "First Citizens Bank & Trust Company", "location": "First Citizens Bank & Trust Company858 reviews-Raleigh, NC 27602", "desc": "Position Description:\n\nAs a Data Loss Protection Engineer, you will be a member of the bank’s Information Security team. This role is responsible for articulating the architectural vision meeting information security requirements to protect Bank information assets, conceptualizing, defining, and evaluating alternate solutions and technologies. This position will lead efforts to develop and validate architecture and high-level solutions design against security and architectural requirements. Lastly, this individual will guide and mentor development teams/peers on methodologies, processes, and leading practices.\n\nThe position supports the people, process and technology used to deliver the Information Security Services. Program activities include:\nTechnical and Program focused architecture, design and implementation of the DLP Service.Vision, strategy, and roadmap for DLP to meet risk mitigation objectives.Evaluation of process and technology deployment of DLP controls and business need.Support, maintenance, or improvement of an existing DLP environment and program.\n\nPosition Requirements:\n\nBachelor’s degree with a minimum of 6 years of experience in systems engineering, networking or information security technologies, including at least 4 years of Symantec (or equivalent) DLP operational experience in an enterprise environment.\n-OR-\nHigh school diploma or GED with a minimum of 10 years of experience in systems engineering, networking or information security technologies, including at least 4 years of Symantec (or equivalent) DLP operational experience in an enterprise environment.\n\nAdditional Requirements:\nMust have implemented and managed DLP programMust possess strong technical knowledge of DLP architecture, system policies, rules, etc.Coding/Scripting experience (e.g. Python, Perl, PowerShell).Proven experience with creating Regular Expressions.Experience with RESTful APIs and automation.Knowledge of data classification solutions.Knowledge of cryptographic implementations at media, file, and application levels.Experience with metadata management and data tagging and creating custom data analytics for data security.Extensive experience in Symantec DLP Incident Remediation and Policy Management.Strong verbal and written communications skills.Work well in team environments with internal and external resources as well as work independently on tasks.Strong organizational and time management skills.Strong customer facing, interpersonal, and technical writing skillsThreat Intelligence administration experience; have used or implemented the above program in some capacity, understanding incident response, analysis, rules, etc.Programming skills for improved automation is preferred.Experience with Cloud and on Premise DLP implementation.\n\nOther Preferred Qualifications:\nFinancial services experience.Bachelor’s Degree in Computer Science or a technology discipline.Experience in a highly regulated industry sector (e.g. Government, Energy, Carrier-Telecommunications).Position relevant information security certifications (e.g. CISSP) and/or Symantec DLP Certification.Microsoft Data Protection solutions experience.", "link": "https://www.indeed.com/viewjob?jk=23fce32d316383ba&tk=1d002lge140gv800&from=serp&alid=3&advn=1665310439615105&sjdu=3j2yV1Cyo1TUbNt3be92UhUiWrWwqW_Iydx70fpDRmFQC5q5BAAOsvilp2d1iBMw"},
{"title": "Data Scientist - Big Data", "company": "NTT DATA Services", "location": "NTT DATA Services1,684 reviews-Durham, NC", "desc": "Req ID: 32813\nAt NTT DATA Services, we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees are key factors in our company’s growth, market presence and our ability to help our clients stay a step ahead of the competition. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for NTT DATA Services and for the people who work here.\nNTT DATA Services currently seeks a Data Scientist - Big Data to join our team in Durham, North Carolina (US-NC), United States (US).\nDay to Day job Duties: (what this person will do on a daily/weekly basis)\nEvaluate trends, characterize factors, develop predictive models, and identify optimization opportunities.\nProvide accurate, timely, relevant and quality analysis that translate data into sound organizational decisions.\nResearch, design and prototype robust and scalable models based on machine learning, data mining, and statistical modeling to answer key business problems.\nBuild tools and support structures needed to analyze data, perform elements of data cleaning, feature selection and feature engineering and organize experiments in conjunction with best practices.\nWork with development teams & business groups to ensure models can be implemented as part of a delivered solution replicable across many clients.\nPresent findings to stakeholders to drive improvements and solutions from concept through to delivery.\n\nBasic Qualifications: (what are the skills required to this job with minimum years of experience on each)\nData Scientist-Hadoop: 3-5 years\nStrong skills in software prototyping and engineering with expertise in applicable programming and analytics languages (Python, R, C/C++) and various open source machine learning and analytics packages to generate deliverable modules and prototype demonstrations of their work\nSQL programming skills\nExperience with design and implementation of analytic models and methodologies for new applications.\nExperience with data visualization tools (e.g. Tableau)\nExperience with large and complex data sets\nDemonstrated ability to propose novel solutions to problems, performing experiments to show feasibility of their solutions and working to refine the solutions into a real-world context\nStrong analytical, written, and verbal communication skills\n\nTravel: Need Locals\nDegree: Bachelors in Computer Science or equivalent work experience\nDesirable Skills / Experience:\n\nPhD in computer science, computer engineering or MS with 3+ years of experience in related field.\nDeep knowledge of fundamentals of machine learning, data mining and statistical predictive modeling, and extensive experience applying these methods to real world problems\nDesired interdisciplinary skills include big data technologies, ETL, statistics and causal inference, Deep Learning, modeling and simulation\nBreadth of skills and experience in machine learning – diverse types of data, diverse data sources, different types of learning models, diverse learning settings\nExperience in Healthcare domain\nThis position is only available to those interested in direct staff employment opportunities with NTT DATA, Inc. or its subsidiaries. Please note, 1099 or corp-2-corp contractors or the equivalent will NOT be considered. We offer a full comprehensive benefits package that starts from your first day of employment.\nAbout NTT DATA Services\nNTT DATA Services partners with clients to navigate and simplify the modern complexities of business and technology, delivering the insights, solutions and outcomes that matter most. We deliver tangible business results by combining deep industry expertise with applied innovations in digital, cloud and automation across a comprehensive portfolio of consulting, applications, infrastructure and business process services.\nNTT DATA Services, headquartered in Plano, Texas, is a division of NTT DATA Corporation, a top 10 global business and IT services provider with 118,000+ professionals in more than 50 countries, and NTT Group, a partner to 88 percent of the Fortune 100. Visit nttdataservices.com to learn more.\nNTT DATA, Inc. (the “Company”) is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, gender identity, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result.", "link": "https://www.indeed.com/viewjob?jk=71be6c16d049a272&tk=1d002lge140gv806&from=serp&alid=3&advn=2454529721716050&sjdu=6ByzYMZLGYUgyrbSdN0cjDS0YJ0zhqMz6O3n9imrEhy6n5_c17FhDcYBcd683ubBNLJ8k5YoEK89MDAyFbysM0c5ZOWpU1JsL7Z2DrlU2jajUO-oB4fDDoMFbLlkpkuwc_90jrLAlJf0eKcnhNRgcHePmUVzYsmxsLfJ3MjijgXfTgYTaNcE-jJC4qiN53Jk5ZWTrPlz5HWD54EKtAm1ew"},
{"title": "Data Scientist", "company": "Veritude", "location": "Veritude101 reviews-Durham, NC", "desc": "TemporaryVeritude is seeking Data Scientist for Fidelity Investments. This position is based in Durham, NC.\n\nAbout Fidelity Labs\nFidelity Labs incubates internal startups—made up of product managers, designers, developers and marketers—that are tasked with creating new business that drive growth and deliver on Fidelity's mission. Our teams' passion combined with human-centered design and agile methodologies are responsible for driving industry transformation and customer impact at scale. See what we’re up to at www.FidelityLabs.com.\n\nThe Expertise We’re Looking For\n\nIf you are driven by the numbers and have a passion for diving into data and extracting that will impact business and marketing decisions, this job is for you. In addition to the below, the ideal candidate will have strong communication skills and the ability to work collaboratively across teams.\n\n\nDegree in Analytics, IT, Economics or related field (Advanced Technical or Business Degree a plus)\n5+ years of data management and marketing experience, with 2+ years direct experience with data management in a cloud environment either in an eCommerce environment or for a Database Management/Customer Insights firm .\nStrong data analytics expertise, including experience translating customer KPIs into actionable marketing strategies that drive growth.\nExperience with data analytics tools and technologies across data (Google Analytics, Omniture, SQL, R, SAS, Python), visualization (Tableau, QlikView, or PowerBI))\nExperience with data warehouses, Big Data and Data Lakes a plus\nExperience with Lean Startup, Design Thinking, and Agile Methodologies preferred\n\nThe Purpose of Your Role\nThe Data Scientist is a key role on the Go To Market team where you will work closely with our Growth Hackers, Technologists, Operations and Product Managers to understand their business needs and relationship to the marketing data and insights. Through measured tactics, and validated strategies you will contribute to the success of our internal startups by providing high quality data analysis that turn insights into actionable recommendations to drive customer lifetime value, business results and growth for small to medium sized selfcontained projects. This role is based in Boston, MA or Durham, NC\n\nThe Skills Your Bring\nData Extraction, Analysis and Ongoing Customer Data Management\nCollaborate to build an end-to-end, extendable customer data solution from defining requirements to data migration and creation of dashboards, ensuring data integrity, accuracy and compliance. As needed, ensure that our services provider has the appropriate functional and technical specifications, direction and resources to deliver the solution.\n\n• Own overall omni-channel customer data management approach with IT, including post-launch maintenance and enhancements. Collaborate with Go To Market, Technologists, Operations, Product, technology and other functional teams as needed around data management & quality, data governance, and data requirements.\nBe part of the team the helps define the digital marketing ecosystem/roadmap and delivers a marketing technology stack that is scalable, extendable, and uses consumer data to enhance the consumer journey and drives brand and business growth. Work with key stakeholders to help define an integrated digital marketing analytics and attribution approach.\nCustomer Insights & Segmentation Strategy\n\n• Collaborate with key analytics stakeholders, leading data analytics development and segmentation analysis. Define and deliver our customer insights approach and reporting capabilities that ultimately drive long-term consumer relationships\nManage the insights coming from customer data to tell stories – ones that turn insights into actionable recommendations that drive customer lifetime value, business results and growth.\nWork with multiple teams to develop a customer’s journey, experience and lifecycle strategies for key customer groups and audience segments. Identify opportunities throughout the consumer journey to increase customer acquisition, conversion and retention that will help drive and influence email, social, advertising, and site strategies.\nHelp develop the brand’s personalization and audience management strategy across the consumer journey, including email, site, and digital marketing.\nWork with teams to advise on A/B and multivariate testing approaches as well as control group and segments management.\n\nThe Value You Deliver\n\n• Expertise in analytical insights, measured tactics, and validated strategies to turn data analysis into actionable recommendations.\nStrong understanding around how big data is influencing customer analytics and the consumer journey, with an ability to pivot with change and pinpoint growth opportunities through customer centricity.\nStrong understanding of customer lifecycle marketing, segmentation, testing, and optimization strategies and a knowledge of marketing/cloud technologies, preferably Salesforce Marketing Cloud\nExcellent communication, collaboration, and planning skills; demonstrated success in communicating ideas to various stakeholders\nPrioritizes workload, managing multiple and often competing tasks, and meets deadlines for various and fluctuating marketing deliverables\nAbility to identify the metrics to drive success, measure KPIs, socialize understanding and drive initiatives to completion\nOutstanding team player and positive attitude, with a strong sense of ownership and accountability\n\nHow Your Work Impacts the Organization\n\nFidelity Labs’ mission to create new businesses that drive growth and deliver on Fidelity’s mission to inspire better futures and deliver better outcomes for the customers and businesses we serve. Our focus is on important financial “jobs to be done,” where people and organizations are experiencing real issues and where we believe we can help. We believe in creating impact at scale and meaningfully improving the lives of the people we serve. Company Overview\n\nAt Fidelity, we are focused on making our financial expertise broadly accessible and effective in helping people live the lives they want. We are a privately held company that places a high degree of value in creating and nurturing a work environment that attracts the best talent and reflects our commitment to our associates. For information about working at Fidelity, visit FidelityCareers.com\n\nFidelity Investments is an equal opportunity employer", "link": "https://www.indeed.com/viewjob?jk=260eff05c2caf33f&tk=1d002lgbt40gv802&from=serp&alid=3&advn=2738627601089396&sjdu=ws-YkYAWZS_RuAPOjvjipFSAoM0BvT4sbrI7SuuJE1Y-F4oooDbzsIwnYxme6Tl5vAE5bZnhKTV59tV6tcPxBA"}
]