[
{"title": "Data Analyst, International", "company": "Bandwidth", "location": "Bandwidth20 reviews-Raleigh, NC 27616", "desc": "Who We Are:\nBandwidth lives for innovation! Our technology powers brands like Google, Microsoft, GoDaddy, Arlo, Netgear, Zoom, Rover and more of the most exciting leaders in technology. Our intelligent voice, messaging, 9-1-1 access, and phone number services— all backed by Bandwidth's own nationwide, all-IP voice network—allow us to power the way people communicate, connect, and do business.\n\nWhat We Are Looking For:\nThe Data Analyst, International works with the International team providing carrier cost evaluation and visibility dashboards, rate change and route updating visibility, capacity analysis, development of ILD rates to all countries (long tail) that reflect actual cost and traffic patterns, analysis of call completion and cost statistics, interface with TAC and NOC on traffic pattern changes and anomalies, develop customer proposals and customer rate deck preparation, build mechanism to update customer rate decks based on cost changes.\n\nWhat You'll Do:\n\nMonitor network data, to determine traffic and cost distributions daily.\nImplement programs to evaluate impact of rate changes and mechanism to update customer rate decks.\nWork with International team to develop custom and baseline International rate decks.\nCreate automated anomaly detection systems and consistently track cost and network performance.\nConduct thorough data mining using state-of-the-art methods.\nAnalyze and report on network and cost data with internal and third party sources of information.\nConduct data processing, cleansing, and verification of integrity of data used for analysis.\nSupport all ILD and overseas products.\n\nWhat You Need:\n\n3-5 years practical experience with data processing, database programming and data analytics\nBachelor's degree in Computer Science, Statistics, Applied Math, or related field.\nBig data tools such as Hadoop/MapReduce and its popular components. Database architectures, data models, query languages and reporting. Mathematical and visualization functions within databases and spreadsheets.\nMachine learning/AI techniques, features, and classifiers.\nProgramming and scripting; statistics skills, including distributions, statistical testing, and regression.\nExcellent pattern recognition and predictive modeling skills.\nProficiency conducting research and development of statistical learning models for data analysis. Excellent communication skills (written and oral).\n\nBonus Points:\n\nGraduate degree in Computer Science, Statistics, Applied Math, or related field\n2-3 years of data science/analytics or equivalent Military experience\n\"R\" software programming language\nCan build dashboards using near real-time data and build graphs/charts to visualize and alarm on near-real time data.\n\nThe Whole Person Promise:\nWe make a \"Whole Person\" promise to our team. You can have both meaningful work PLUS a full life at Bandwidth. We focus on accomplishing our mission as \"whole people.\" That means we take care of our people—in body, mind, and spirit.\n\n\nHealth: We pay 100% for benefits coverage including Medical, Dental, Vision, Prescription, Life, and Disability. Corporate chaplains, EAP and 401K match.\nFitness: 90-minute fitness lunch with a paid gym membership with shuttle service available for workouts. On-site cardio gym, locker room/showers, classes, and sponsored sports and leagues. Nutritionist and personal trainer on-site.\nVolunteer: We have a program dedicated to providing volunteer opportunities to employees, Bandwidthcares.\n\n", "link": "https://www.indeed.com/viewjob?jk=47f5252e7b4dae68&q=data+science&l=Research+Triangle+Park%2C+NC&from=web&advn=6826049403241636&sjdu=VyNrwcfTK15LupteTX0rmTRS_BxzuPaiMEa1y6sac4kTA6R_kO1Tgt7FOv47Pafpznt6tB7JDVG13vDW7smeig&acatk=1d003nali43gv802&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"title": "Data Loss Protection Engineer", "company": "First Citizens Bank & Trust Company", "location": "First Citizens Bank & Trust Company858 reviews-Raleigh, NC 27602", "desc": "Position Description:\n\nAs a Data Loss Protection Engineer, you will be a member of the bank’s Information Security team. This role is responsible for articulating the architectural vision meeting information security requirements to protect Bank information assets, conceptualizing, defining, and evaluating alternate solutions and technologies. This position will lead efforts to develop and validate architecture and high-level solutions design against security and architectural requirements. Lastly, this individual will guide and mentor development teams/peers on methodologies, processes, and leading practices.\n\nThe position supports the people, process and technology used to deliver the Information Security Services. Program activities include:\nTechnical and Program focused architecture, design and implementation of the DLP Service.Vision, strategy, and roadmap for DLP to meet risk mitigation objectives.Evaluation of process and technology deployment of DLP controls and business need.Support, maintenance, or improvement of an existing DLP environment and program.\n\nPosition Requirements:\n\nBachelor’s degree with a minimum of 6 years of experience in systems engineering, networking or information security technologies, including at least 4 years of Symantec (or equivalent) DLP operational experience in an enterprise environment.\n-OR-\nHigh school diploma or GED with a minimum of 10 years of experience in systems engineering, networking or information security technologies, including at least 4 years of Symantec (or equivalent) DLP operational experience in an enterprise environment.\n\nAdditional Requirements:\nMust have implemented and managed DLP programMust possess strong technical knowledge of DLP architecture, system policies, rules, etc.Coding/Scripting experience (e.g. Python, Perl, PowerShell).Proven experience with creating Regular Expressions.Experience with RESTful APIs and automation.Knowledge of data classification solutions.Knowledge of cryptographic implementations at media, file, and application levels.Experience with metadata management and data tagging and creating custom data analytics for data security.Extensive experience in Symantec DLP Incident Remediation and Policy Management.Strong verbal and written communications skills.Work well in team environments with internal and external resources as well as work independently on tasks.Strong organizational and time management skills.Strong customer facing, interpersonal, and technical writing skillsThreat Intelligence administration experience; have used or implemented the above program in some capacity, understanding incident response, analysis, rules, etc.Programming skills for improved automation is preferred.Experience with Cloud and on Premise DLP implementation.\n\nOther Preferred Qualifications:\nFinancial services experience.Bachelor’s Degree in Computer Science or a technology discipline.Experience in a highly regulated industry sector (e.g. Government, Energy, Carrier-Telecommunications).Position relevant information security certifications (e.g. CISSP) and/or Symantec DLP Certification.Microsoft Data Protection solutions experience.", "link": "https://www.indeed.com/viewjob?jk=23fce32d316383ba&tk=1d003napa43gu802&from=serp&alid=3&advn=1665310439615105&sjdu=3j2yV1Cyo1TUbNt3be92UhUiWrWwqW_Iydx70fpDRmFQC5q5BAAOsvilp2d1iBMw"},
{"title": "Data Scientist - Big Data", "company": "NTT DATA Services", "location": "NTT DATA Services1,684 reviews-Durham, NC", "desc": "Req ID: 32813\nAt NTT DATA Services, we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees are key factors in our company’s growth, market presence and our ability to help our clients stay a step ahead of the competition. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for NTT DATA Services and for the people who work here.\nNTT DATA Services currently seeks a Data Scientist - Big Data to join our team in Durham, North Carolina (US-NC), United States (US).\nDay to Day job Duties: (what this person will do on a daily/weekly basis)\nEvaluate trends, characterize factors, develop predictive models, and identify optimization opportunities.\nProvide accurate, timely, relevant and quality analysis that translate data into sound organizational decisions.\nResearch, design and prototype robust and scalable models based on machine learning, data mining, and statistical modeling to answer key business problems.\nBuild tools and support structures needed to analyze data, perform elements of data cleaning, feature selection and feature engineering and organize experiments in conjunction with best practices.\nWork with development teams & business groups to ensure models can be implemented as part of a delivered solution replicable across many clients.\nPresent findings to stakeholders to drive improvements and solutions from concept through to delivery.\n\nBasic Qualifications: (what are the skills required to this job with minimum years of experience on each)\nData Scientist-Hadoop: 3-5 years\nStrong skills in software prototyping and engineering with expertise in applicable programming and analytics languages (Python, R, C/C++) and various open source machine learning and analytics packages to generate deliverable modules and prototype demonstrations of their work\nSQL programming skills\nExperience with design and implementation of analytic models and methodologies for new applications.\nExperience with data visualization tools (e.g. Tableau)\nExperience with large and complex data sets\nDemonstrated ability to propose novel solutions to problems, performing experiments to show feasibility of their solutions and working to refine the solutions into a real-world context\nStrong analytical, written, and verbal communication skills\n\nTravel: Need Locals\nDegree: Bachelors in Computer Science or equivalent work experience\nDesirable Skills / Experience:\n\nPhD in computer science, computer engineering or MS with 3+ years of experience in related field.\nDeep knowledge of fundamentals of machine learning, data mining and statistical predictive modeling, and extensive experience applying these methods to real world problems\nDesired interdisciplinary skills include big data technologies, ETL, statistics and causal inference, Deep Learning, modeling and simulation\nBreadth of skills and experience in machine learning – diverse types of data, diverse data sources, different types of learning models, diverse learning settings\nExperience in Healthcare domain\nThis position is only available to those interested in direct staff employment opportunities with NTT DATA, Inc. or its subsidiaries. Please note, 1099 or corp-2-corp contractors or the equivalent will NOT be considered. We offer a full comprehensive benefits package that starts from your first day of employment.\nAbout NTT DATA Services\nNTT DATA Services partners with clients to navigate and simplify the modern complexities of business and technology, delivering the insights, solutions and outcomes that matter most. We deliver tangible business results by combining deep industry expertise with applied innovations in digital, cloud and automation across a comprehensive portfolio of consulting, applications, infrastructure and business process services.\nNTT DATA Services, headquartered in Plano, Texas, is a division of NTT DATA Corporation, a top 10 global business and IT services provider with 118,000+ professionals in more than 50 countries, and NTT Group, a partner to 88 percent of the Fortune 100. Visit nttdataservices.com to learn more.\nNTT DATA, Inc. (the “Company”) is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, gender identity, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result.", "link": "https://www.indeed.com/viewjob?jk=71be6c16d049a272&tk=1d003napm43gu801&from=serp&alid=3&advn=2454529721716050&sjdu=6ByzYMZLGYUgyrbSdN0cjDS0YJ0zhqMz6O3n9imrEhy6n5_c17FhDcYBcd683ubBNLJ8k5YoEK89MDAyFbysM0c5ZOWpU1JsL7Z2DrlU2jajUO-oB4fDDoMFbLlkpkuwc_90jrLAlJf0eKcnhNRgcHePmUVzYsmxsLfJ3MjijgXfTgYTaNcE-jJC4qiN53Jk5ZWTrPlz5HWD54EKtAm1ew"},
{"title": "Data Leakage Protection Engineer", "company": "MPIRE Technology Group, Inc.", "location": "MPIRE Technology Group, Inc.-Raleigh, NC", "desc": "MPIRE Technology Group is seeking a Data Leakage Protection Engineerto join our team, supporting our client in Raleigh, NC. Candidates should have extensive experience in Symantec Data Leakage Protection (DLP) Incident Remediation and Policy Management and will need to provide data analysis to identify incident trends and patterns. Candidates with programming skills for improved automation arepreferred.Skills/Technologies:3 Years of Symantec and/or McAfee DLP operational experience is required; must have implemented and managedDLP program; must possess strong technical knowledge of DLP architecture, system policies, rules, etc. Coding/Scripting experience (e.g. Python, Perl, PowerShell)Proven experience with creating Regular ExpressionsExperience with RESTful APIs and automationKnowledge of data classification solutionsKnowledge of cryptographic implementations at media, file, and application levelsExperience with metadata management and data tagging and creating custom data analytics for data securityStrong verbal and written communications skills; must be able to effectively communicate technical details and thoughts in nontechnical/general terminology to various levels of the organization.Work well in team environments with internal and external resources as well as work independently on tasksStrong organizational, and time management skillsRequired:Bachelor’s Degree in ComputerScience, Information Technology or InformationSecurityAll candidates must be USCitizens, or have a permanent residence status(Green Card).Cannot have more than 6 monthsof travel outside the United States within the last five years. (Military Service excluded)Pass a client mandatedclearance process to include drug screening, criminalhistory check and credit checkOne or more of the following certifications are required:o CompTIASecurity +o CPTE– CertifiedPenetration Testing Engineero CEH - CertifiedEthical Hackero CISSP- CertifiedInformation SystemSecurity ProfessionalAble to obtain Postal clearanceNice to Have:Master’s Degree preferredOSCPCertificationCloud Access Security Broker (CASB) implementation and/or management experienceNext Generation Anti Malware implementation and/or management experienceThreat Intelligence administration experience; have used or implemented the above program in some capacity, understanding incident response, analysis, rules, etcExperience: Mid-SeniorLevel(7+years)Job Type: Full-timeExperience:Scripting: 1 year (Preferred)RESTFul APIs: 1 year (Required)Regular Expressions: 1 year (Required)Python: 1 year (Preferred)Symantec or McAFee DLP: 3 years (Required)Location:Raleigh, NC (Required)Work authorization:United States (Required)", "link": "https://www.indeed.com/cmp/MPIRE-Technology-Group,-Inc./jobs/Data-Leakage-Protection-Engineer-8c7570d7e828325f?sjdu=QwrRXKrqZ3CNX5W-O9jEvSFTw7VMruWlKNLDw1Yts3Zlo9Faw0yEQWfDQY_THTT9mE6Cq344roHdCi6V4pczFRctMy9B06wlU4WznVfvQ04&vjs=3"},
{"title": "Data Scientist", "company": "Veritude", "location": "Veritude101 reviews-Durham, NC", "desc": "TemporaryVeritude is seeking Data Scientist for Fidelity Investments. This position is based in Durham, NC.\n\nAbout Fidelity Labs\nFidelity Labs incubates internal startups—made up of product managers, designers, developers and marketers—that are tasked with creating new business that drive growth and deliver on Fidelity's mission. Our teams' passion combined with human-centered design and agile methodologies are responsible for driving industry transformation and customer impact at scale. See what we’re up to at www.FidelityLabs.com.\n\nThe Expertise We’re Looking For\n\nIf you are driven by the numbers and have a passion for diving into data and extracting that will impact business and marketing decisions, this job is for you. In addition to the below, the ideal candidate will have strong communication skills and the ability to work collaboratively across teams.\n\n\nDegree in Analytics, IT, Economics or related field (Advanced Technical or Business Degree a plus)\n5+ years of data management and marketing experience, with 2+ years direct experience with data management in a cloud environment either in an eCommerce environment or for a Database Management/Customer Insights firm .\nStrong data analytics expertise, including experience translating customer KPIs into actionable marketing strategies that drive growth.\nExperience with data analytics tools and technologies across data (Google Analytics, Omniture, SQL, R, SAS, Python), visualization (Tableau, QlikView, or PowerBI))\nExperience with data warehouses, Big Data and Data Lakes a plus\nExperience with Lean Startup, Design Thinking, and Agile Methodologies preferred\n\nThe Purpose of Your Role\nThe Data Scientist is a key role on the Go To Market team where you will work closely with our Growth Hackers, Technologists, Operations and Product Managers to understand their business needs and relationship to the marketing data and insights. Through measured tactics, and validated strategies you will contribute to the success of our internal startups by providing high quality data analysis that turn insights into actionable recommendations to drive customer lifetime value, business results and growth for small to medium sized selfcontained projects. This role is based in Boston, MA or Durham, NC\n\nThe Skills Your Bring\nData Extraction, Analysis and Ongoing Customer Data Management\nCollaborate to build an end-to-end, extendable customer data solution from defining requirements to data migration and creation of dashboards, ensuring data integrity, accuracy and compliance. As needed, ensure that our services provider has the appropriate functional and technical specifications, direction and resources to deliver the solution.\n\n• Own overall omni-channel customer data management approach with IT, including post-launch maintenance and enhancements. Collaborate with Go To Market, Technologists, Operations, Product, technology and other functional teams as needed around data management & quality, data governance, and data requirements.\nBe part of the team the helps define the digital marketing ecosystem/roadmap and delivers a marketing technology stack that is scalable, extendable, and uses consumer data to enhance the consumer journey and drives brand and business growth. Work with key stakeholders to help define an integrated digital marketing analytics and attribution approach.\nCustomer Insights & Segmentation Strategy\n\n• Collaborate with key analytics stakeholders, leading data analytics development and segmentation analysis. Define and deliver our customer insights approach and reporting capabilities that ultimately drive long-term consumer relationships\nManage the insights coming from customer data to tell stories – ones that turn insights into actionable recommendations that drive customer lifetime value, business results and growth.\nWork with multiple teams to develop a customer’s journey, experience and lifecycle strategies for key customer groups and audience segments. Identify opportunities throughout the consumer journey to increase customer acquisition, conversion and retention that will help drive and influence email, social, advertising, and site strategies.\nHelp develop the brand’s personalization and audience management strategy across the consumer journey, including email, site, and digital marketing.\nWork with teams to advise on A/B and multivariate testing approaches as well as control group and segments management.\n\nThe Value You Deliver\n\n• Expertise in analytical insights, measured tactics, and validated strategies to turn data analysis into actionable recommendations.\nStrong understanding around how big data is influencing customer analytics and the consumer journey, with an ability to pivot with change and pinpoint growth opportunities through customer centricity.\nStrong understanding of customer lifecycle marketing, segmentation, testing, and optimization strategies and a knowledge of marketing/cloud technologies, preferably Salesforce Marketing Cloud\nExcellent communication, collaboration, and planning skills; demonstrated success in communicating ideas to various stakeholders\nPrioritizes workload, managing multiple and often competing tasks, and meets deadlines for various and fluctuating marketing deliverables\nAbility to identify the metrics to drive success, measure KPIs, socialize understanding and drive initiatives to completion\nOutstanding team player and positive attitude, with a strong sense of ownership and accountability\n\nHow Your Work Impacts the Organization\n\nFidelity Labs’ mission to create new businesses that drive growth and deliver on Fidelity’s mission to inspire better futures and deliver better outcomes for the customers and businesses we serve. Our focus is on important financial “jobs to be done,” where people and organizations are experiencing real issues and where we believe we can help. We believe in creating impact at scale and meaningfully improving the lives of the people we serve. Company Overview\n\nAt Fidelity, we are focused on making our financial expertise broadly accessible and effective in helping people live the lives they want. We are a privately held company that places a high degree of value in creating and nurturing a work environment that attracts the best talent and reflects our commitment to our associates. For information about working at Fidelity, visit FidelityCareers.com\n\nFidelity Investments is an equal opportunity employer", "link": "https://www.indeed.com/viewjob?jk=260eff05c2caf33f&tk=1d003napk43gu800&from=serp&alid=3&advn=2738627601089396&sjdu=ws-YkYAWZS_RuAPOjvjipFSAoM0BvT4sbrI7SuuJE1Y-F4oooDbzsIwnYxme6Tl5vAE5bZnhKTV59tV6tcPxBA"}
]