[
{"title": "Data Scientist", "company": "NIEHS", "location": "NIEHS-Durham, NC 27709", "link": "https://www.indeed.com/cmp/NIEHS/jobs/Data-Scientist-b4e60d9398cbbf13?vjs=3", "desc": "$75,628 - $98,317 a yearWe are looking to hire two Data Scientist positions at the National Institute of Environmental Health Sciences (NIEHS) in Research Triangle Park, NC.NOTE: applications for the positions will be accepted from Dec. 13 through Dec. 17 on USAjobs (https://www.usajobs.gov/).Come apply your biomedical knowledge and computing skills (especially Python, R, and JavaScript) to enable the discovery, access, and use of data needed to advance environmental health research, policy, and decision-making. Looking for candidates who like to keep learning and applying new approaches and technologies.The first position supports the Division of the National Toxicology Program (DNTP) efforts in the collection, management, reporting, analysis, visualization and storing of experimental toxicology data. The second position is within the Office of Data Science (ODS), which serves the data science needs of the entire institute through the development and application of data methods, computer technologies, and data systems.Primary responsibilities will include:1) development and support of web-applications and databases and user-friendly web-based interfaces;2) design, deployment, and maintenance of computer tools and methods to enhance the extraction, analysis, visualization and usage of data; and3) assistance in the development and deployment of data and knowledge systems (especially the NIEHS Data Commons and interoperability with the NIH Data Commons).Job Type: Full-timeSalary: $75,628.00 to $98,317.00 /yearExperience:Python: 2 years (Required)Javascript: 2 years (Required)working with scientific data: 1 year (Required)Data Analysis: 1 year (Required)R: 2 years (Preferred)"},
{"title": "Data Science Developer", "company": "DrugDev", "location": "DrugDev14 reviews-Durham, NC", "link": "https://www.indeed.com/viewjob?jk=5dfcbb545fa87108&from=serp&vjs=3", "desc": "Job Description\nJoin us on our exciting journey! IQVIA™ is The Human Data Science Company™, focused on using data and science to help healthcare clients find better solutions for their patients. Formed through the merger of IMS Health and Quintiles, IQVIA offers a broad range of solutions that harness advances in healthcare information, technology, analytics and human ingenuity to drive healthcare forward.\nJoin us on our exciting journey!\n\nIQVIA™ is The Human Data Science Company™, focused on using data and science to help healthcare clients find better solutions for their patients. Formed through the merger of IMS Health and Quintiles, IQVIA offers a broad range of solutions that harness advances in healthcare information, technology, analytics and human ingenuity to drive healthcare forward.\n\nThe Analytics Center of Excellence\nOur new Analytics Center of Excellence (ACOE) harnesses our global healthcare insights, working closely with our clinical and therapeutic experts to power evidence-driven design, speed site activation and recruit the right patients, faster. This is a new unit within our business, integrated within Clinical Operations. We’re using big data and advanced analytics to derive insights that transform clinical development and bring new medicines to patients faster through successful trial delivery.\nThis multi-functional team is an innovation for our business, requiring entrepreneurial and independent thinking to build our capability. Unique and with a global view, this Center of Excellence is a chance to revolutionize the clinical research industry.\n\nData Science Engineer – the role\nAs an expert software developer, this is a unique opportunity to leverage your skills to empower advanced analytics and to build unparalleled in-depth knowledge within our business. Working with modern distributed analytics systems, complex data, and challenging requests, you will help shape the way our team approaches prototyping and development of data-driven analytics products. This crucial role involves identifying opportunities for better data modelling, abstraction, testing, internal tooling, and other software development practices that will help our team maximize our efficiency in data science projects. You will have the opportunity to provide technical leadership and mentorship to the team, and to set the standards for code quality and architecture for the projects you work on. You will also serve as a key liaison for our team with production developers.\n\nYour typical activities might include:\nCollaborating with data scientists to turn working prototypes into well-abstracted, reusable modules for iterative development of data science projects.\nProviding technical leadership and assisting the team on execution of technical tasks centered on delivery of analytics models.\nIdentifying opportunities for improvements to internal processes regarding model development, including internal data pipelines and modelling frameworks that will facilitate advanced analytics.\nBeing involved in every stage of the data product development life cycle; from coordinating initial requirements with business owners, through development with subject matter experts and data scientists, to production deployments with developers.\nOverseeing multiple projects from concept to completion.\nComprehensive testing of your own code.\nProduction deployments of advanced analytics.\nQualification:\nOur ideal candidate will have:\nA Bachelors or Masters degree in STEM field such as Computer Science, Engineering, Statistics, Mathematics\n5+ years of object oriented programming experience in a high level language like Python, java, Scala\n3+ years of relevant collaborative software development experience.\nExtensive experience with dynamic scripting languages such as Python and R.\nExtensive experience work in Hadoop eco system like YARN, Hive, Impala, Map Reduce,\nExperience working with large volumes of complex data, preferably in distributed frameworks such as Spark, SparkR and PySpark.\nStrong familiarity with data science concepts and modeling techniques.\nExperience implementing design patterns and implementing testing frameworks\nStrong SQL or Hive skills.\nLocal language skills to an advanced level (spoken and written), with complete fluency in English.\nIQVIA is an EEO Employer - Minorities/Females/Protected Veterans/Disabled\n\nWe know that meaningful results require not only the right approach but also the right people. Regardless of your role, we invite you to reimagine healthcare with us. You will have the opportunity to play an important part in helping our clients drive healthcare forward and ultimately improve human health outcomes.\n\nWhatever your career goals, we are here to ensure you get there!\nWe invite you to join IQVIA™.\n\n#LI-TF1\n#GLD\nIQVIA is an EEO Employer - Minorities/Females/Protected Veterans/Disabled'\nWe know that meaningful results require not only the right approach but also the right people. Regardless of your role, we invite you to reimagine healthcare with us. You will have the opportunity to play an important part in helping our clients drive healthcare forward and ultimately improve human health outcomes. Whatever your career goals, we are here to ensure you get there! We invite you to join IQVIA™\nJob ID: R1056202"},
{"title": "Data Scientist-Internship", "company": "TKXS", "location": "TKXS-Morrisville, NC 27560", "link": "https://www.indeed.com/viewjob?jk=92ef5a0bdbb3d450&from=serp&vjs=3", "desc": "InternshipTKXS Data Science Summer Internship Opportunity\n\nTKXS is a leading provider of technology and data-driven services in the agriculture, healthcare and B2B/industrial verticals. We're looking for an Intern to join our Data Science Practice (DSP) for the summer to gain invaluable experience and help us explore some exciting analytic opportunities.\n\nJob Responsibilities:\n Work with structured and unstructured data to build new customer reports on purchasing behavior\n Utilize the scientific method and approach when coming up with modeling techniques\n Create predictive models on how current behavior could affect future outcomes\n Incorporate modeling solutions into current business systems that would be scalable for multiple customers\n Summarize results by creating visualizations in Tableau and presenting out to the team and larger audiences on your findings\n Collaborate with other team members and organizations to gather data and understand problem requirements\nDesired Qualifications:\n\nA rising Junior or Senior working towards a Bachelor’s degree in science, technology, engineering, data science or mathematics (STEM) related field, such as:\nStatistics\nOperations research\nMathematics\nExperience in statistical modeling\nFamiliarity with data manipulation in SQL and R/Python\nAbility to summarize results in software like Tableau or R and present findings\nMinimum Qualifications:\n\nFull-time student pursuing a Bachelor's degree in a technical field\nGPA of at least 3.0 on a 4-point scale\nAttending school on a full-time basis before/following this internship\nCreativity\nInitiative\nLeadership abilities\nProblem solving skills\nAbility to work in a diverse team environment\n Collaborate with other team members and organizations to gather data and understand problem requirements\nWhat we offer:\n\n A competitive hourly rate of pay\n The possibility of a Full time position after graduation\n A casual friendly work environment\n An excellent culture that fosters camaraderie and fun, while providing engaging intellectual challenges"},
{"title": "Analyst - Data Analytics", "company": "Blaze Advisors", "location": "Blaze Advisors-Raleigh-Durham, NC", "link": "https://www.indeed.com/cmp/Blaze-Advisors/jobs/Analyst-8e875e4ebb85691f?vjs=3", "desc": "Location Preference: Southeast USUnder the direction of the SVP - Healthcare Information Systems & Strategy and working with various analysts, consultants and executives, play an active role in data collection, aggregation, analysis, and reporting. This includes but is not limited to gathering and analyzing information, formulating and testing hypotheses, developing client presentations with findings, and making recommendations.Job Requirements:Undergraduate degree in business analytics, computer science, statistics or applied mathematics.Minimum 1-year experience in data analytics work experience after completing your undergraduate degree or an advanced degree in Business Analytics or Data Science.An ability to process large amounts of strategic and tactical information into practical applications that are easily understood by all employees and clients across a wide range of non-technical skill-sets and backgrounds.Deep passion for improving patient care.Blaze Advisors founders started their careers providing direct care and have carried that passion and focus throughout their careers and into the heart of this organization. As Blaze Advisors has grown, we have continued this focus by bringing in new employees that share in this deep passion.COMPANY DESCRIPTIONBlaze Advisors, LLC is a boutique healthcare consulting firm with operational expertise in developing high-performance networks, clinical integration, quality reporting, and care management as well as a strategic perspective on how to align organizational resources and goals with regional, payer, and vendor interests. Our team is as multi-faceted as our client’s needs and able to assist in:High-Performance network design and clinical integrationPopulation health analyticsCare management modelsAt risk reimbursement modelsAlternate Payment Models (APMs)Our consultants are subject matter experts with professional experience in creating high-performance networks that are clinically and operationally integrated across the continuum and inclusive of a vast array of traditional medical providers and specialty sector providers including behavioral health, post-acute care, and community-based organizations. Our team has real-life experience based on successes and lessons learned regarding management of at-risk payments and achieving effective results that improve patient care and experiences.Job Type: Full-timeEducation:Bachelor's (Required)Work authorization:United States (Required)"},
{"title": "Data Science, Intern", "company": "Automated Insights", "location": "Automated Insights2 reviews-Durham, NC 27701", "link": "https://www.indeed.com/viewjob?jk=76b11e68bdacf6e6&from=serp&vjs=3", "desc": "InternshipAbout Automated Insights\n\nAutomated Insights (Ai) helps organizations make better business decisions, faster. By empowering data-driven organizations with Ai’s proprietary natural language generation (NLG) platform, Wordsmith, businesses are able to deliver the right insight, to the right person, at the right time and in the easiest-to-understand medium—the written word. Wordsmith makes exploring, discovering, and communicating insights easier than ever before. Our Wordsmith platform turns raw data into written narratives for clients like Activision, Yahoo!, and the Associated Press.\n\nAt Automated Insights, we are dedicated to treating all Ai-ers with respect, autonomy, and generosity. We strive to provide a best-in-career work experience for each and every employee. We know that having an excellent company culture is an advantage and we’ve created an environment which empowers our team to do their best work. We've even been recognized for this and are a five-time winner of Triangle Business Journal's Best Place to Work Award.\n\nWhy does the Data Science internship exist?\n\nThe Data Science team is looking for interns who are excited to hone their skills building innovative technology that makes our customers’ lives easier. Our interns are full members of the team; they participate in project meetings, present results to company stakeholders, and produce as much as they learn. At the end of your internship, you'll walk away with a great understanding of how a tight-knit, fast-paced team turns ideas into customer-facing products.\n\nWhat would I do as a Data Science intern?\n\nWork with data scientists, software engineers, and product managers to understand our customers' goals and problems, and help us use machine learning and natural language processing to solve those problems.\nTake ownership over transforming your ideas into reality – you'll prototype new algorithms, write high-quality, professional code, and be responsible for documenting your work and results.\nBe a member of the team by participating in team planning meetings, standups, reading groups, and code reviews.\n\nWhat is experience is required?\n\nStudents pursuing an undergrad or advanced degree in a technical discipline.\nProgramming experience in a language like Python or Javascript.\nExperience outside of the classroom, like previous industry work, open-source contributions, or personal side projects.\nQuick learners who love jumping into difficult projects.\nBonus points if you have a solid understanding of the fundamentals of machine learning and experience dealing with unstructured data.\n\nWhat’s cool about the job?\n\nYou’ll collaborate with other software engineers via pair programming, PR Reviews, stand-ups, and planning meetings.\nYou’ll understand and help refine technical requirements by working with data scientists and product managers.\nYou’ll make a big impact on mission-critical projects."},
{"title": "Data Analyst, International", "company": "Bandwidth", "location": "Bandwidth20 reviews-Raleigh, NC 27616", "link": "https://www.indeed.com/viewjob?jk=47f5252e7b4dae68&q=data+science&l=Research+Triangle+Park%2C+NC&from=web&advn=6826049403241636&sjdu=VyNrwcfTK15LupteTX0rmTRS_BxzuPaiMEa1y6sac4kTA6R_kO1Tgt7FOv47Pafpznt6tB7JDVG13vDW7smeig&acatk=1d003q8o9440u800&pub=4a1b367933fd867b19b072952f68dceb&vjs=3", "desc": "Who We Are:\nBandwidth lives for innovation! Our technology powers brands like Google, Microsoft, GoDaddy, Arlo, Netgear, Zoom, Rover and more of the most exciting leaders in technology. Our intelligent voice, messaging, 9-1-1 access, and phone number services— all backed by Bandwidth's own nationwide, all-IP voice network—allow us to power the way people communicate, connect, and do business.\n\nWhat We Are Looking For:\nThe Data Analyst, International works with the International team providing carrier cost evaluation and visibility dashboards, rate change and route updating visibility, capacity analysis, development of ILD rates to all countries (long tail) that reflect actual cost and traffic patterns, analysis of call completion and cost statistics, interface with TAC and NOC on traffic pattern changes and anomalies, develop customer proposals and customer rate deck preparation, build mechanism to update customer rate decks based on cost changes.\n\nWhat You'll Do:\n\nMonitor network data, to determine traffic and cost distributions daily.\nImplement programs to evaluate impact of rate changes and mechanism to update customer rate decks.\nWork with International team to develop custom and baseline International rate decks.\nCreate automated anomaly detection systems and consistently track cost and network performance.\nConduct thorough data mining using state-of-the-art methods.\nAnalyze and report on network and cost data with internal and third party sources of information.\nConduct data processing, cleansing, and verification of integrity of data used for analysis.\nSupport all ILD and overseas products.\n\nWhat You Need:\n\n3-5 years practical experience with data processing, database programming and data analytics\nBachelor's degree in Computer Science, Statistics, Applied Math, or related field.\nBig data tools such as Hadoop/MapReduce and its popular components. Database architectures, data models, query languages and reporting. Mathematical and visualization functions within databases and spreadsheets.\nMachine learning/AI techniques, features, and classifiers.\nProgramming and scripting; statistics skills, including distributions, statistical testing, and regression.\nExcellent pattern recognition and predictive modeling skills.\nProficiency conducting research and development of statistical learning models for data analysis. Excellent communication skills (written and oral).\n\nBonus Points:\n\nGraduate degree in Computer Science, Statistics, Applied Math, or related field\n2-3 years of data science/analytics or equivalent Military experience\n\"R\" software programming language\nCan build dashboards using near real-time data and build graphs/charts to visualize and alarm on near-real time data.\n\nThe Whole Person Promise:\nWe make a \"Whole Person\" promise to our team. You can have both meaningful work PLUS a full life at Bandwidth. We focus on accomplishing our mission as \"whole people.\" That means we take care of our people—in body, mind, and spirit.\n\n\nHealth: We pay 100% for benefits coverage including Medical, Dental, Vision, Prescription, Life, and Disability. Corporate chaplains, EAP and 401K match.\nFitness: 90-minute fitness lunch with a paid gym membership with shuttle service available for workouts. On-site cardio gym, locker room/showers, classes, and sponsored sports and leagues. Nutritionist and personal trainer on-site.\nVolunteer: We have a program dedicated to providing volunteer opportunities to employees, Bandwidthcares.\n\n"},
{"title": "Data Scientist", "company": "Veritude", "location": "Veritude101 reviews-Durham, NC", "link": "https://www.indeed.com/viewjob?jk=260eff05c2caf33f&tk=1d003q8qv440u802&from=serp&alid=3&advn=2738627601089396&sjdu=ws-YkYAWZS_RuAPOjvjipFSAoM0BvT4sbrI7SuuJE1Y-F4oooDbzsIwnYxme6Tl5vAE5bZnhKTV59tV6tcPxBA", "desc": "TemporaryVeritude is seeking Data Scientist for Fidelity Investments. This position is based in Durham, NC.\n\nAbout Fidelity Labs\nFidelity Labs incubates internal startups—made up of product managers, designers, developers and marketers—that are tasked with creating new business that drive growth and deliver on Fidelity's mission. Our teams' passion combined with human-centered design and agile methodologies are responsible for driving industry transformation and customer impact at scale. See what we’re up to at www.FidelityLabs.com.\n\nThe Expertise We’re Looking For\n\nIf you are driven by the numbers and have a passion for diving into data and extracting that will impact business and marketing decisions, this job is for you. In addition to the below, the ideal candidate will have strong communication skills and the ability to work collaboratively across teams.\n\n\nDegree in Analytics, IT, Economics or related field (Advanced Technical or Business Degree a plus)\n5+ years of data management and marketing experience, with 2+ years direct experience with data management in a cloud environment either in an eCommerce environment or for a Database Management/Customer Insights firm .\nStrong data analytics expertise, including experience translating customer KPIs into actionable marketing strategies that drive growth.\nExperience with data analytics tools and technologies across data (Google Analytics, Omniture, SQL, R, SAS, Python), visualization (Tableau, QlikView, or PowerBI))\nExperience with data warehouses, Big Data and Data Lakes a plus\nExperience with Lean Startup, Design Thinking, and Agile Methodologies preferred\n\nThe Purpose of Your Role\nThe Data Scientist is a key role on the Go To Market team where you will work closely with our Growth Hackers, Technologists, Operations and Product Managers to understand their business needs and relationship to the marketing data and insights. Through measured tactics, and validated strategies you will contribute to the success of our internal startups by providing high quality data analysis that turn insights into actionable recommendations to drive customer lifetime value, business results and growth for small to medium sized selfcontained projects. This role is based in Boston, MA or Durham, NC\n\nThe Skills Your Bring\nData Extraction, Analysis and Ongoing Customer Data Management\nCollaborate to build an end-to-end, extendable customer data solution from defining requirements to data migration and creation of dashboards, ensuring data integrity, accuracy and compliance. As needed, ensure that our services provider has the appropriate functional and technical specifications, direction and resources to deliver the solution.\n\n• Own overall omni-channel customer data management approach with IT, including post-launch maintenance and enhancements. Collaborate with Go To Market, Technologists, Operations, Product, technology and other functional teams as needed around data management & quality, data governance, and data requirements.\nBe part of the team the helps define the digital marketing ecosystem/roadmap and delivers a marketing technology stack that is scalable, extendable, and uses consumer data to enhance the consumer journey and drives brand and business growth. Work with key stakeholders to help define an integrated digital marketing analytics and attribution approach.\nCustomer Insights & Segmentation Strategy\n\n• Collaborate with key analytics stakeholders, leading data analytics development and segmentation analysis. Define and deliver our customer insights approach and reporting capabilities that ultimately drive long-term consumer relationships\nManage the insights coming from customer data to tell stories – ones that turn insights into actionable recommendations that drive customer lifetime value, business results and growth.\nWork with multiple teams to develop a customer’s journey, experience and lifecycle strategies for key customer groups and audience segments. Identify opportunities throughout the consumer journey to increase customer acquisition, conversion and retention that will help drive and influence email, social, advertising, and site strategies.\nHelp develop the brand’s personalization and audience management strategy across the consumer journey, including email, site, and digital marketing.\nWork with teams to advise on A/B and multivariate testing approaches as well as control group and segments management.\n\nThe Value You Deliver\n\n• Expertise in analytical insights, measured tactics, and validated strategies to turn data analysis into actionable recommendations.\nStrong understanding around how big data is influencing customer analytics and the consumer journey, with an ability to pivot with change and pinpoint growth opportunities through customer centricity.\nStrong understanding of customer lifecycle marketing, segmentation, testing, and optimization strategies and a knowledge of marketing/cloud technologies, preferably Salesforce Marketing Cloud\nExcellent communication, collaboration, and planning skills; demonstrated success in communicating ideas to various stakeholders\nPrioritizes workload, managing multiple and often competing tasks, and meets deadlines for various and fluctuating marketing deliverables\nAbility to identify the metrics to drive success, measure KPIs, socialize understanding and drive initiatives to completion\nOutstanding team player and positive attitude, with a strong sense of ownership and accountability\n\nHow Your Work Impacts the Organization\n\nFidelity Labs’ mission to create new businesses that drive growth and deliver on Fidelity’s mission to inspire better futures and deliver better outcomes for the customers and businesses we serve. Our focus is on important financial “jobs to be done,” where people and organizations are experiencing real issues and where we believe we can help. We believe in creating impact at scale and meaningfully improving the lives of the people we serve. Company Overview\n\nAt Fidelity, we are focused on making our financial expertise broadly accessible and effective in helping people live the lives they want. We are a privately held company that places a high degree of value in creating and nurturing a work environment that attracts the best talent and reflects our commitment to our associates. For information about working at Fidelity, visit FidelityCareers.com\n\nFidelity Investments is an equal opportunity employer"},
{"title": "Data Loss Protection Engineer", "company": "First Citizens Bank & Trust Company", "location": "First Citizens Bank & Trust Company858 reviews-Raleigh, NC 27602", "link": "https://www.indeed.com/viewjob?jk=23fce32d316383ba&tk=1d003q8sg440u800&from=serp&alid=3&advn=1665310439615105&sjdu=3j2yV1Cyo1TUbNt3be92UhUiWrWwqW_Iydx70fpDRmFQC5q5BAAOsvilp2d1iBMw", "desc": "Position Description:\n\nAs a Data Loss Protection Engineer, you will be a member of the bank’s Information Security team. This role is responsible for articulating the architectural vision meeting information security requirements to protect Bank information assets, conceptualizing, defining, and evaluating alternate solutions and technologies. This position will lead efforts to develop and validate architecture and high-level solutions design against security and architectural requirements. Lastly, this individual will guide and mentor development teams/peers on methodologies, processes, and leading practices.\n\nThe position supports the people, process and technology used to deliver the Information Security Services. Program activities include:\nTechnical and Program focused architecture, design and implementation of the DLP Service.Vision, strategy, and roadmap for DLP to meet risk mitigation objectives.Evaluation of process and technology deployment of DLP controls and business need.Support, maintenance, or improvement of an existing DLP environment and program.\n\nPosition Requirements:\n\nBachelor’s degree with a minimum of 6 years of experience in systems engineering, networking or information security technologies, including at least 4 years of Symantec (or equivalent) DLP operational experience in an enterprise environment.\n-OR-\nHigh school diploma or GED with a minimum of 10 years of experience in systems engineering, networking or information security technologies, including at least 4 years of Symantec (or equivalent) DLP operational experience in an enterprise environment.\n\nAdditional Requirements:\nMust have implemented and managed DLP programMust possess strong technical knowledge of DLP architecture, system policies, rules, etc.Coding/Scripting experience (e.g. Python, Perl, PowerShell).Proven experience with creating Regular Expressions.Experience with RESTful APIs and automation.Knowledge of data classification solutions.Knowledge of cryptographic implementations at media, file, and application levels.Experience with metadata management and data tagging and creating custom data analytics for data security.Extensive experience in Symantec DLP Incident Remediation and Policy Management.Strong verbal and written communications skills.Work well in team environments with internal and external resources as well as work independently on tasks.Strong organizational and time management skills.Strong customer facing, interpersonal, and technical writing skillsThreat Intelligence administration experience; have used or implemented the above program in some capacity, understanding incident response, analysis, rules, etc.Programming skills for improved automation is preferred.Experience with Cloud and on Premise DLP implementation.\n\nOther Preferred Qualifications:\nFinancial services experience.Bachelor’s Degree in Computer Science or a technology discipline.Experience in a highly regulated industry sector (e.g. Government, Energy, Carrier-Telecommunications).Position relevant information security certifications (e.g. CISSP) and/or Symantec DLP Certification.Microsoft Data Protection solutions experience."},
{"title": "Data Science", "company": "NetApp", "location": "NetApp627 reviews-Research Triangle Park, NC 27709", "link": "https://www.indeed.com/viewjob?jk=bd92081f3304c237&from=serp&vjs=3", "desc": "Job Summary\n\n\nNetApp is looking for a Data Scientist focused on providing data-driven, action-oriented solutions to challenging business problems. Business-minded data scientist with a demonstrated ability to deliver valuable insight via data analytics and advanced data-driven methods. The ideal candidate is an independent, solution-oriented thinker with a strong background processing large data sets, applying analytical rigor and statistical methods, and driving towards actionable insights and novel solutions.\nSpecific Responsibilities\nAccountable for translating complex analytical concepts into actionable results\nDevelop predictive data models that will help to personalize interaction with business\nAnalyze and process complex data sets using advanced querying, visualization and analytic tools\nProduce appropriate and effective project deliverables\nDemonstrate a strong understanding of project scope, data extraction methodology, design of dependent and profile variables, logic and design of data cleaning, exploratory data analysis and statistical methods\nWork closely with Information Architect and business teams to understand the data from end to end perspective across business domains enterprise wide\nPartner with the Data Architect to build the optimal advance tools and self-service capabilities for the business units\n Day to Day\nDeveloping machine learning, optimization, or other modeling solutions as required\nDesign and develop reports/dashboards by interpreting the business, user, functional, and non-functional requirements\nProduct appropriate and effective project deliverables on problems such as, sample diagnostics, customer profiles, complex queries, data mining, model algorithms, charts, model score distributions, etc\nFind insights in large and fragmented data sets across database types and tools\nWork with multi-disciplined team taking full ownership of turning discoveries and ideas into models\n\n\n\nJob Requirements\n\nThe requirements listed below are representative of the knowledge, skill, and/or ability required to be a successful Data Scientist at NetApp.\nAbility to apply data science and data characterization technologies\nMust work across diverse project in a dynamic and collaborative environment\nConduct end to end analysis and apply novel solutions from the best of academia, open source, and commercial against our most challenging problems\nAssess and discover technology developments, determine relevance to project, and operationally prototype them against real work data and problems in actual code using agile development techniques\nInteract cross-functionally with a wide variety of people and identify opportunities to incorporate advanced analytics into existing workflows\nMust be current on technologies and systems and be able to explain them to audiences of all levels and functions\nMust be organized and analytical, adept at working in a team environment, able to design and implement a project schedule, and able to handle multiple priorities\nTechnology\nExperience with the following required:\nBroad understanding of statistical theory and application\nStatistical tools (R, R Studio, tidyverse, SQL Server R Services)\nETL development skills, Advanced T-SQL to support data collection, cleaning and validation\nAdvanced visualization training tools: Tableau, MS Power BI and others as they become available\nExperience with state-of-the-art techniques in machine learning algorithms, including deep neural networks, NLP, kernel methods, dimensionality reduction in supervised and unsupervised contexts, ensemble methods, network analysis.\nStrong analytical and data processing skills and comfortable working with large data sets and ability to transform data into actionable insights\nExceptional technical skills:\nStrong programming skills in at least one language such as Python, java, Scala, C++, Julia\nExperience with SQL and relational databases\nExperience with unstructured and semi-structured data sources and requisite processing tools\nAbility to work in an agile environment\nExperience using Hadoop, MapReduce, Spark and/or other distributed processing tool\n\n\n\n\nEducation\n\nGraduate degree in Mathematics, Statistics, CS, Data Science or a closely related education with 2+ years of experience in the IT industry with a focus on Statistics or Analytics\nExperience with common methods used in regression and classification problems (e.g. Random Forests, Support Vector machines, etc)\nExperience with Time Series Analysis, Survival Analysist, fixed and random effects, and developing models in contexts where observations are not IID\nKnowledge and experience with advanced statistical techniques and concepts (regression, properties of distributions, statistical tests, experimental design, and proper usage, etc)"},
{"title": "Developer Advocate, Data Science Education", "company": "Google", "location": "Google2,734 reviews-Chapel Hill, NC 27516", "link": "https://www.indeed.com/viewjob?jk=61e881a747ba4729&from=serp&vjs=3", "desc": "Note: By applying to this position your application is automatically submitted to the following locations: Boulder, CO, USA; Austin, TX, USA; Chapel Hill, NC, USA; Cambridge, MA, USA; Chicago, IL, USA; Irvine, CA, USA; Kirkland, WA, USA; Los Angeles, CA, USA; New York, NY, USA; Seattle, WA, USA; San Francisco, CA, USA; Sunnyvale, CA, USA\nQualifications\nMinimum qualifications:\n\nBachelor's degree in Computer Science, related technical field, or equivalent practical experience.\n3 years of experience in coding with Python.\n2 years of experience in data science with an emphasis on machine learning.\nExperience engaging with online learning communities through competition participation, dataset publishing, kernel authorship, or a combination of the three.\n\nPreferred qualifications:\n\nExperience in all major branches of data science (i.e., deep learning, exploratory data analysis, data visualization, GLM-style modeling, etc.).\nExperience teaching data science skills to students, colleagues, or the general public.\nExperience applying data science principles to solve real-world problem.\nExcellent communication skills.\nAbout the job\n\nKaggle is a data science community where users come to learn and improve their skills. Kaggle Learn is a platform that provides free data science courses to a rapidly growing community. Our team is geographically distributed across North American and Eastern Australia.\nAs a Developer Advocate, you will play a key role in the growth of Kaggle by creating new courses and improving existing ones. You will support aspiring and existing data scientist with new material and enable users to make the most out of Kaggle's repository and public notebook, Kernels.\nResponsibilities\n\nCreate free, fast-paced data science courses for Kaggle.\nDesign well-structured courses on major data science topics.\nWrite short explanatory tutorials.\nWrite hands-on exercises to build and test user's knowledge of course content.\nWrite Python code that gives feedback to users in response to their exercise solutions.\nLocation\n\n\n\nChapel Hill, NC, USA\n\nAt Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by emailing candidateaccommodations@google.com.\nTo all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other organization location. Google is not responsible for any fees related to unsolicited resumes."},
{"title": "Intern - Data Science - Summer 2019", "company": "Xylem", "location": "Xylem282 reviews-Morrisville, NC", "link": "https://www.indeed.com/viewjob?jk=a824b7f280ead3b5&from=serp&vjs=3", "desc": "Temporary, InternshipXylem (XYL) is a leading global water technology company committed to developing innovative technology solutions to the world’s water challenges. The Company’s products and services move, treat, analyze, monitor and return water to the environment in public utility, industrial, residential and commercial building services settings. Xylem also provides a leading portfolio of smart metering, network technologies and advanced infrastructure analytics solutions for water, electric and gas utilities. The Company’s more than 16,500 employees bring broad applications expertise with a strong focus on identifying comprehensive, sustainable solutions. Headquartered in Rye Brook, New York with 2017 revenue of $4.7 billion, Xylem does business in more than 150 countries through a number of market-leading product brands.\nThe name Xylem is derived from classical Greek and is the tissue that transports water in plants, highlighting the engineering efficiency of our water-centric business by linking it with the best water transportation of all – that which occurs in nature. For more information, please visit us at www.xylem.com.\nThe Role: Xylem seeks to hire a Data Science Intern. You will be analyzing millions of time series using state of the art statistical methods, advanced machine learning, and big data technologies. Our data science team is a friendly collaborative environment. If you are excited and passionate to work on state-of-the art technology trends we want to hear from you!\nEssential Functions:\nPassion for applications, analytics, storage and distributed systems\nEnjoy working in a fast-paced agile environment using Scrum\nExcellent written and verbal communication skills\nStrong customer focus\nMinimum Qualifications:\nCurrently an accredited University studying toward a Bachelor’s of Science degree in Computer Science, Statistics or equivalent.\nExperience with object oriented coding languages such as Java and Python\nExperience with R programming language\nAbility to work collaboratively within a team environment of engineers to meet aggressive goals and high quality standards\nDemonstrated experience working with cross functional teams\nPreferred Qualifications:\nExperience with online distributed systems and platform infrastructure design and implementation\nExperience with the Hadoop ecosystem and Spark\nExperience in databases, analytics, big data systems or business intelligence products\nPhysical Demands:\n(The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.)\nLight lifting (20-25 lbs.), office environment\nRegularly required to sit or stand, reach, bend and move about the facility\nWork Environment:\n(The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.)\nOffice: Standard office equipment; work usually performed in an office setting free from any disagreeable elements.\nStandard weekly job hours: 40 hours\n\nEOE including disability and veteran"},
{"title": "Data Science Developer", "company": "IQVIA", "location": "IQVIA161 reviews-Durham, NC", "link": "https://www.indeed.com/viewjob?jk=e42dabf977940e35&from=serp&vjs=3", "desc": "Join us on our exciting journey! IQVIA™ is The Human Data Science Company™, focused on using data and science to help healthcare clients find better solutions for their patients. Formed through the merger of IMS Health and Quintiles, IQVIA offers a broad range of solutions that harness advances in healthcare information, technology, analytics and human ingenuity to drive healthcare forward.\nJoin us on our exciting journey!\n\nIQVIA™ is The Human Data Science Company™, focused on using data and science to help healthcare clients find better solutions for their patients. Formed through the merger of IMS Health and Quintiles, IQVIA offers a broad range of solutions that harness advances in healthcare information, technology, analytics and human ingenuity to drive healthcare forward.\n\nThe Analytics Center of Excellence\nOur new Analytics Center of Excellence (ACOE) harnesses our global healthcare insights, working closely with our clinical and therapeutic experts to power evidence-driven design, speed site activation and recruit the right patients, faster. This is a new unit within our business, integrated within Clinical Operations. We’re using big data and advanced analytics to derive insights that transform clinical development and bring new medicines to patients faster through successful trial delivery.\nThis multi-functional team is an innovation for our business, requiring entrepreneurial and independent thinking to build our capability. Unique and with a global view, this Center of Excellence is a chance to revolutionize the clinical research industry.\n\nData Science Engineer – the role\nAs an expert software developer, this is a unique opportunity to leverage your skills to empower advanced analytics and to build unparalleled in-depth knowledge within our business. Working with modern distributed analytics systems, complex data, and challenging requests, you will help shape the way our team approaches prototyping and development of data-driven analytics products. This crucial role involves identifying opportunities for better data modelling, abstraction, testing, internal tooling, and other software development practices that will help our team maximize our efficiency in data science projects. You will have the opportunity to provide technical leadership and mentorship to the team, and to set the standards for code quality and architecture for the projects you work on. You will also serve as a key liaison for our team with production developers.\n\nYour typical activities might include:\nCollaborating with data scientists to turn working prototypes into well-abstracted, reusable modules for iterative development of data science projects.\nProviding technical leadership and assisting the team on execution of technical tasks centered on delivery of analytics models.\nIdentifying opportunities for improvements to internal processes regarding model development, including internal data pipelines and modelling frameworks that will facilitate advanced analytics.\nBeing involved in every stage of the data product development life cycle; from coordinating initial requirements with business owners, through development with subject matter experts and data scientists, to production deployments with developers.\nOverseeing multiple projects from concept to completion.\nComprehensive testing of your own code.\nProduction deployments of advanced analytics.\nQualification:\nOur ideal candidate will have:\nA Bachelors or Masters degree in STEM field such as Computer Science, Engineering, Statistics, Mathematics\n5+ years of object oriented programming experience in a high level language like Python, java, Scala\n3+ years of relevant collaborative software development experience.\nExtensive experience with dynamic scripting languages such as Python and R.\nExtensive experience work in Hadoop eco system like YARN, Hive, Impala, Map Reduce,\nExperience working with large volumes of complex data, preferably in distributed frameworks such as Spark, SparkR and PySpark.\nStrong familiarity with data science concepts and modeling techniques.\nExperience implementing design patterns and implementing testing frameworks\nStrong SQL or Hive skills.\nLocal language skills to an advanced level (spoken and written), with complete fluency in English.\nIQVIA is an EEO Employer - Minorities/Females/Protected Veterans/Disabled\n\nWe know that meaningful results require not only the right approach but also the right people. Regardless of your role, we invite you to reimagine healthcare with us. You will have the opportunity to play an important part in helping our clients drive healthcare forward and ultimately improve human health outcomes.\n\nWhatever your career goals, we are here to ensure you get there!\nWe invite you to join IQVIA™.\n\n#LI-TF1\n#GLD\nIQVIA is an EEO Employer - Minorities/Females/Protected Veterans/Disabled'\nWe know that meaningful results require not only the right approach but also the right people. Regardless of your role, we invite you to reimagine healthcare with us. You will have the opportunity to play an important part in helping our clients drive healthcare forward and ultimately improve human health outcomes. Whatever your career goals, we are here to ensure you get there! We invite you to join IQVIA™"},
{"title": "Data Analyst", "company": "FMI Corporation", "location": "FMI Corporation10 reviews-Raleigh, NC 27612", "link": "https://www.indeed.com/viewjob?jk=22b5cf9f8da1ba6a&from=serp&vjs=3", "desc": "Overview\nFMI’s Management Consulting Analytics team is seeking a high-energy, self-motivated Data Analyst with demonstrated quantitative and analytical skills to join its growing team.This full-time position will be based in our downtown Raleigh, North Carolina corporate headquarters.\nThe data analyst will be responsible for compiling and synthesizing company financials and related operations and performance data into custom-formatted data reports.\nResponsibilities\nDeveloping and implementing data analyses, data collection systems, and other strategies that optimize statistical efficiency and quality\nAcquiring data from primary or secondary data sources and maintain databases\nWorking with management team to create a prioritized list of needs for our clients and the Analytics team\nUsing data to create models that depict trends in client performance and the population as a whole\nWorking with the Data Analytics Manager to outline the specific data needs for analysis projects\nQualifications\nBachelor’s degree from an accredited college or university in accounting, business, finance, computer science, statistics, data science or related field\nDemonstrated database and data mining experience\nSuperior organizational, time management and project management skills, and the ability to exercise sound independent judgment\nDemonstrated maturity, integrity and the ability to work in an ambiguous entrepreneurial environment, both individually and as a team player\nHigh attention to detail\nExcellent written and verbal communication, listening, problem solving, interpersonal and relationship-building skills\nStrong proficiency with Microsoft Office: Word, Excel, PowerPoint\nPrevious experience with Tableau a plus"},
{"title": "Data Leakage Protection Engineer", "company": "MPIRE Technology Group, Inc.", "location": "MPIRE Technology Group, Inc.-Raleigh, NC", "link": "https://www.indeed.com/cmp/MPIRE-Technology-Group,-Inc./jobs/Data-Leakage-Protection-Engineer-8c7570d7e828325f?sjdu=QwrRXKrqZ3CNX5W-O9jEvSFTw7VMruWlKNLDw1Yts3Zlo9Faw0yEQWfDQY_THTT9mE6Cq344roHdCi6V4pczFRctMy9B06wlU4WznVfvQ04&vjs=3", "desc": "MPIRE Technology Group is seeking a Data Leakage Protection Engineerto join our team, supporting our client in Raleigh, NC. Candidates should have extensive experience in Symantec Data Leakage Protection (DLP) Incident Remediation and Policy Management and will need to provide data analysis to identify incident trends and patterns. Candidates with programming skills for improved automation arepreferred.Skills/Technologies:3 Years of Symantec and/or McAfee DLP operational experience is required; must have implemented and managedDLP program; must possess strong technical knowledge of DLP architecture, system policies, rules, etc. Coding/Scripting experience (e.g. Python, Perl, PowerShell)Proven experience with creating Regular ExpressionsExperience with RESTful APIs and automationKnowledge of data classification solutionsKnowledge of cryptographic implementations at media, file, and application levelsExperience with metadata management and data tagging and creating custom data analytics for data securityStrong verbal and written communications skills; must be able to effectively communicate technical details and thoughts in nontechnical/general terminology to various levels of the organization.Work well in team environments with internal and external resources as well as work independently on tasksStrong organizational, and time management skillsRequired:Bachelor’s Degree in ComputerScience, Information Technology or InformationSecurityAll candidates must be USCitizens, or have a permanent residence status(Green Card).Cannot have more than 6 monthsof travel outside the United States within the last five years. (Military Service excluded)Pass a client mandatedclearance process to include drug screening, criminalhistory check and credit checkOne or more of the following certifications are required:o CompTIASecurity +o CPTE– CertifiedPenetration Testing Engineero CEH - CertifiedEthical Hackero CISSP- CertifiedInformation SystemSecurity ProfessionalAble to obtain Postal clearanceNice to Have:Master’s Degree preferredOSCPCertificationCloud Access Security Broker (CASB) implementation and/or management experienceNext Generation Anti Malware implementation and/or management experienceThreat Intelligence administration experience; have used or implemented the above program in some capacity, understanding incident response, analysis, rules, etcExperience: Mid-SeniorLevel(7+years)Job Type: Full-timeExperience:Scripting: 1 year (Preferred)RESTFul APIs: 1 year (Required)Regular Expressions: 1 year (Required)Python: 1 year (Preferred)Symantec or McAFee DLP: 3 years (Required)Location:Raleigh, NC (Required)Work authorization:United States (Required)"},
{"title": "Data Scientist - Big Data", "company": "NTT DATA Services", "location": "NTT DATA Services1,684 reviews-Durham, NC", "link": "https://www.indeed.com/viewjob?jk=71be6c16d049a272&tk=1d003q98e440v802&from=serp&alid=3&advn=2454529721716050&sjdu=6ByzYMZLGYUgyrbSdN0cjDS0YJ0zhqMz6O3n9imrEhy6n5_c17FhDcYBcd683ubBNLJ8k5YoEK89MDAyFbysM0c5ZOWpU1JsL7Z2DrlU2jajUO-oB4fDDoMFbLlkpkuwc_90jrLAlJf0eKcnhNRgcHePmUVzYsmxsLfJ3MjijgXfTgYTaNcE-jJC4qiN53Jk5ZWTrPlz5HWD54EKtAm1ew", "desc": "Req ID: 32813\nAt NTT DATA Services, we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees are key factors in our company’s growth, market presence and our ability to help our clients stay a step ahead of the competition. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for NTT DATA Services and for the people who work here.\nNTT DATA Services currently seeks a Data Scientist - Big Data to join our team in Durham, North Carolina (US-NC), United States (US).\nDay to Day job Duties: (what this person will do on a daily/weekly basis)\nEvaluate trends, characterize factors, develop predictive models, and identify optimization opportunities.\nProvide accurate, timely, relevant and quality analysis that translate data into sound organizational decisions.\nResearch, design and prototype robust and scalable models based on machine learning, data mining, and statistical modeling to answer key business problems.\nBuild tools and support structures needed to analyze data, perform elements of data cleaning, feature selection and feature engineering and organize experiments in conjunction with best practices.\nWork with development teams & business groups to ensure models can be implemented as part of a delivered solution replicable across many clients.\nPresent findings to stakeholders to drive improvements and solutions from concept through to delivery.\n\nBasic Qualifications: (what are the skills required to this job with minimum years of experience on each)\nData Scientist-Hadoop: 3-5 years\nStrong skills in software prototyping and engineering with expertise in applicable programming and analytics languages (Python, R, C/C++) and various open source machine learning and analytics packages to generate deliverable modules and prototype demonstrations of their work\nSQL programming skills\nExperience with design and implementation of analytic models and methodologies for new applications.\nExperience with data visualization tools (e.g. Tableau)\nExperience with large and complex data sets\nDemonstrated ability to propose novel solutions to problems, performing experiments to show feasibility of their solutions and working to refine the solutions into a real-world context\nStrong analytical, written, and verbal communication skills\n\nTravel: Need Locals\nDegree: Bachelors in Computer Science or equivalent work experience\nDesirable Skills / Experience:\n\nPhD in computer science, computer engineering or MS with 3+ years of experience in related field.\nDeep knowledge of fundamentals of machine learning, data mining and statistical predictive modeling, and extensive experience applying these methods to real world problems\nDesired interdisciplinary skills include big data technologies, ETL, statistics and causal inference, Deep Learning, modeling and simulation\nBreadth of skills and experience in machine learning – diverse types of data, diverse data sources, different types of learning models, diverse learning settings\nExperience in Healthcare domain\nThis position is only available to those interested in direct staff employment opportunities with NTT DATA, Inc. or its subsidiaries. Please note, 1099 or corp-2-corp contractors or the equivalent will NOT be considered. We offer a full comprehensive benefits package that starts from your first day of employment.\nAbout NTT DATA Services\nNTT DATA Services partners with clients to navigate and simplify the modern complexities of business and technology, delivering the insights, solutions and outcomes that matter most. We deliver tangible business results by combining deep industry expertise with applied innovations in digital, cloud and automation across a comprehensive portfolio of consulting, applications, infrastructure and business process services.\nNTT DATA Services, headquartered in Plano, Texas, is a division of NTT DATA Corporation, a top 10 global business and IT services provider with 118,000+ professionals in more than 50 countries, and NTT Group, a partner to 88 percent of the Fortune 100. Visit nttdataservices.com to learn more.\nNTT DATA, Inc. (the “Company”) is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, gender identity, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result."}
]